{
  "title": "School of Divination", 
  "description": "The counsel of a diviner is sought by royalty and commoners alike, for all seek a clearer understanding of the past, present, and future. As a diviner, you strive to part the veils of space, time, and consciousness so that you can see clearly. You work to master spells of discernment, remote viewing, supernatural knowledge, and foresight.", 
  "features": {
    "2": {
      "DIVINATION SAVANT": {
        "title": "Divination Savant", 
        "description": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy a divination spell into your spellbook is halved."
      }, 
      "PORTENT": {
        "title": "Portent", 
        "description": "Starting at 2nd level when you choose this school, glimpses of the future begin to press in on your awareness. When you finish a long rest, roll two d20s and record the numbers rolled. You can replace any attack roll, saving throw, or ability check made by you or a creature that you can see with one of these foretelling rolls. You must choose to do so before the roll, and you can replace a roll in this way only once per turn.\nEach foretelling roll can be used only once. W hen you finish a long rest, you lose any unused foretelling rolls."
      }
    }, 
    "6": {
      "EXPERT DIVINATION": {
        "title": "Expert Divination", 
        "description": "Beginning at 6th level, casting divination spells comes so easily to you that it expends only a fraction of your spellcasting efforts. When you cast a divination spell of 2nd level or higher using a spell slot, you regain one expended spell slot. The slot you regain must be of a level lower than the spell you cast and can’t be higher than 5th level."
      }
    }, 
    "10": {
      "THE THIRD EYE": {
        "title": "The Third Eye", 
        "description": "Starting at 10th level, you can use your action to increase your powers of perception. W hen you do so, choose one of the following benefits, which lasts until you are incapacitated or you take a short or long rest. You can’t use the feature again until you finish a rest.\nDarkvision: You gain darkvision out to a range of 60 feet, as described in chapter 8.\nEthereal Sight: You can see into the Ethereal Plane within 60 feet of you.\nGreater Comprehension: You can read any language.\nSee Invisibility: You can see invisible creatures and objects within 10 feet of you that are within line of sight."
      }
    }, 
    "14": {
      "GREATER PORTENT": {
        "title": "Greater Portent", 
        "description": "Starting at 14th level, the visions in your dreams intensify and paint a m ore accurate picture in your mind of what is to come. You roll three d20s for your Portent feature, rather than two."
      }
    }
  }
}