{
  "title": "Light Domain", 
  "description": "Gods of light—including Helm, Lathander, Pholtus, Branchala, the Silver Flame, Belenus, Apollo, and Ke-Horakhty—promote the ideals of rebirth and renewal, truth, vigilance, and beauty, often using the symbol of the sun. Some of these gods are portrayed as the sun itself or as a charioteer who guides the sun across the sky. Others are tireless sentinels whose eyes pierce every shadow and see through every deception. Some are deities of beauty and artistry, who teach that art is a vehicle for the soul's improvement. Clerics of a god of light are enlightened souls infused with radiance and the power of their gods’ discerning vision, charged with chasing away lies and burning away darkness.", 
  "features": {
    "1": {
      "BONUS CANTRIP": {
        "title": "Bonus Cantrip", 
        "description": "When you choose this domain at 1st level, you gain the Light cantrip if you don't already know it."
      }, 
      "WARDING FLARE": {
        "title": "Warding Flare", 
        "description": "You can interpose divine light between yourself and an attacking enemy. When you are attacked by a creature within 30 feet of you that you can see, you can use your reaction to impose disadvantage on the attack roll, causing light to flare before the attacker before it hits or misses. An attacker that can’t be blinded is immune to this feature.\nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest."
      }
    }, 
    "2": {
      "RADIANCE OF THE DAWN": {
        "title": "Channel Divinity: Radiance of the Dawn", 
        "description": "You can use your Channel Divinity to harness sunlight, banishing darkness and dealing radiant damage to your foes.\nAs an action, you present your holy symbol, and any magical darkness within 30 feet of you is dispelled. Additionally, each hostile creature within 30 feet of you must make a Constitution saving throw. A creature takes radiant damage equal to 2d10 + your cleric level on a failed saving throw, and half as much damage on a successful one. A creature that has total cover from you is not affected."
      }
    }, 
    "6": {
      "IMPROVED FLARE": {
        "title": "Improved Flare", 
        "description": "You can also use your Warding Flare feature when a creature that you can see within 30 feet of you attacks a creature other than you."
      }
    }, 
    "8": {
      "POTENT SPELLCASTING": {
        "title": "Potent Spellcasting", 
        "description": "You add your Wisdom modifier to the damage you deal with any cleric cantrip."
      }
    }, 
    "17": {
      "CORONA OF LIGHT": {
        "title": "Corona of Light", 
        "description": "You can use your action to activate an aura of sunlight that lasts for 1 minute or until you dismiss it using another action. You emit bright light in a 60-foot radius and dim light 30 feet beyond that. Your enemies in the bright light have disadvantage on saving throws against any spell that deals fire or radiant damage."
      }
    }
  }
}