{"playerClasses":{"Sorcerer":{"equipmentPack":"DUNGEONEER","level":{"value":1},"name":"Sorcerer","languages":[],"skillProficiencies":["persuasion","insight"],"weaponProficiencies":["Dagger","Dart","Sling","Quarterstaff","Crossbow, light"],"armorProficiencies":[],"toolProficiencies":[],"weapons":["DAGGER","DAGGER","DAGGER"],"armor":[],"equipment":["ROD"],"toolKits":[],"hitDie":"d6","savingThrowProficiencies":["constitution","charisma"],"features":[],"hpBase":6,"abilitiesAtLevels":{},"subclass":{"name":"WILD MAGIC","subclassDictionary":{"DRACONIC ANCESTRY":{},"STORM SORCERY":{},"WILD MAGIC":{},"SHADOW":{},"DIVINE SOUL":{}}}},"Cleric":{"equipmentPack":"","level":{"value":2},"name":"Cleric","languages":[],"skillProficiencies":[],"weaponProficiencies":[],"armorProficiencies":["Light","Medium","Shield"],"toolProficiencies":[],"weapons":[],"armor":[],"equipment":[],"toolKits":[],"hitDie":"d8","savingThrowProficiencies":[],"features":[],"hpBase":8,"abilitiesAtLevels":{},"subclass":{"name":"TRICKERY","subclassDictionary":{"KNOWLEDGE":{},"LIFE":{},"LIGHT":{},"NATURE":{},"TEMPEST":{},"TRICKERY":{},"WAR":{},"FORGE":{},"GRAVE":{}}}}},"levels":{"Sorcerer":{"value":1},"Cleric":{"value":2}},"feats":[],"name":"Ebil","character":{"inventory":{"weapons":[{"name":"Dagger","weaponType":"Simple Melee","cost":"2gp","damage":"1d4","damageType":"Piercing","weight":"1lb","properties":["Finesse","Light","Thrown","Range 20ft / 60ft Disadvantage"]},{"name":"Dagger","weaponType":"Simple Melee","cost":"2gp","damage":"1d4","damageType":"Piercing","weight":"1lb","properties":["Finesse","Light","Thrown","Range 20ft / 60ft Disadvantage"]},{"name":"Dagger","weaponType":"Simple Melee","cost":"2gp","damage":"1d4","damageType":"Piercing","weight":"1lb","properties":["Finesse","Light","Thrown","Range 20ft / 60ft Disadvantage"]}],"armor":[],"toolKits":[],"gear":[{"name":"Rod","itemType":"Arcane focus","quantity":1,"cost":"10 gp","weight":"2 lb","description":""},{"name":"Backpack","itemType":"Container","quantity":1,"cost":"2 gp","weight":"5 lb","description":"1 cubic foot/30 pounds of gear"},{"name":"Crowbar","itemType":"","quantity":1,"cost":"2 gp","weight":"5 lb","description":"Using a crowbar grants advantage to Strength checks where the crowbar's leverage can be applied"},{"name":"Hammer","itemType":"","quantity":1,"cost":"1 gp","weight":"3 lb","description":""},{"name":"Tinderbox","itemType":"","quantity":1,"cost":"5 sp","weight":"1 lb","description":"This small container holds flint, fire steel, and tinder (usually dry cloth soaked in light oil) used to kindle a fire. Using it to light a torch—or anything else with abundant, exposed fuel—takes an action. Lighting any other fire takes 1 minute."},{"name":"Waterskin","itemType":"Container","quantity":1,"cost":"2 sp","weight":"5 lb (full)","description":"4 points liquid"},{"name":"Rope, hempen (50 feet)","itemType":"","quantity":1,"cost":"1 gp","weight":"4 lb","description":"Rope, whether made of hemp or silk, has 2 hit points and can be burst with a DC 17 Strength check."},{"name":"Torch","itemType":"","quantity":10,"cost":"1 cp","weight":"1 lb","description":"A torch burns for 1 hour, providing bright light in a 20-foot radius and dim light for an additional 20 feet. If you make a melee attack with a burning torch and hit, it deals 1 fire damage."},{"name":"Rations (1 day)","itemType":"","quantity":10,"cost":"5 sp","weight":"2 lb","description":"Rations consist of dry foods suitable for extended travel, including jerky, dried fruit, hardtack, and nuts."},{"name":"Crowbar","itemType":"","quantity":1,"cost":"2 gp","weight":"5 lb","description":"Using a crowbar grants advantage to Strength checks where the crowbar's leverage can be applied"},{"name":"Clothes, common","itemType":"","quantity":1,"cost":"5 sp","weight":"3 lb","description":""}],"gp":15},"traits":{"armorProficiencies":["Light","Medium","Shield"],"weaponProficiencies":["Dagger","Dart","Sling","Quarterstaff","Crossbow, light"],"toolProficiencies":["Thieves' Tools","Playing card set"],"languages":[{"title":"Common","description":"The language of the realm - spoken by all races."},{"title":"Infernal","description":"The language of the Devils (Lawful Evil)."}],"features":[{"title":"Darkvision","description":"You can see in dim light within 60 feet of you as if it were bright light, and within darkness as if it was dim light."},{"title":"Hellish Resistance","description":"You have resistance to fire damage."},{"title":"Infernal Legacy","description":"You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell once per day as a 2nd-level spell. Once you reach 5th level, you can also cast the darkness spell once per day. Charisma is your spellcasting ability for these spells."},{"title":"Criminal Contact","description":"You have a reliable and trustworthy contact who act as your liaison to a network of other criminals. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."},{"title":"Wild Magic Surge","description":"Starting when you choose this origin at 1st level, your spellcasting can unleash surges of untamed magic. Immediately after you cast a sorcerer spell of 1st level or higher, the DM can have you roll a d20. If you roll a 1, roll on the Wild Magic Surge table to create a random magical effect."},{"title":"Tides of Chaos","description":"Starting at 1st level, you can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw. Once you do so, you must finish a long rest before you can use this feature again.\nAny time before you regain the use of this feature, the DM can have you roll on the Wild Magic Surge table immediately after you cast a sorcerer spell of 1st level or higher. You then regain the use of this feature."},{"title":"Blessing of the Trickster","description":"You can use your action to touch a willing creature other than yourself to give it advantage on Dexterity (Stealth) checks. This blessing lasts for 1 hour or until you use this feature again."},{"title":"Channel Divinity: Invoke Duplicity","description":"You can use your Channel Divinity to create an illusory duplicate of yourself.\nAs an action, you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space that you can see within 30 feet of you. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but it must remain within 120 feet of you.\nFor the duration, you can cast spells as though you were in the illusion’s space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how distracting the illusion is to the target."},{"title":"Channel Divinity","description":"You gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.\nWhen you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\nBeginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level you can use it three times between rests. When you finish a short or long rest, you regain your expended uses."},{"title":"Channel Divinity: Turn Undead","description":"As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\nA turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also cant take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action."}],"resources":[{"title":"First Level Spell Slots","description":"Number of first level spells you can cast","resourceMax":{"value":4}},{"title":"Channel Divinity","description":"Number of times you can use a Channel Divinity ability.","resourceMax":{"value":1}},{"title":"Second Level Spell Slots","description":"Number of second level spells you can cast","resourceMax":{"value":2}}],"scalingEffects":[]},"spells":{"0":[{"name":"Fire Bolt","description":"You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn't being worn or carried. This spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10),","school":"evocation","castTime":"1 action","range":"120 feet","concentration":false,"duration":"Instantaneous","components":["V"],"material":"","minimumLevel":"0","ritual":false,"spellAttack":true,"spellcastingAbility":"charisma","source":null},{"name":"Message","description":"You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear, You can cast this spell through solid objects if you are familtar with the target and know it is beyond the barrier. Magical silence. 1 foot of stone, 1 inch of common metal. a thin sheet of lead, or 3 feet of wood blocks the spell. The spell doesn't have to follow a straight line and can travel freely around corners or through openings.","school":"transmutation","castTime":"1 action","range":"120 feet","concentration":false,"duration":"1 round","components":["V","S","M"],"material":"a short piece of copper wire","minimumLevel":"0","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma","source":null},{"name":"Shocking Grasp","description":"Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d8 lightning damage, and it can't take reactions until the start of its next turn. The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (448).","school":"evocation","castTime":"1 action","range":"Touch","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"0","ritual":false,"spellAttack":true,"spellcastingAbility":"charisma","source":null},{"name":"Ray Of Frost","description":"A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn. The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).","school":"evocation","castTime":"1 action","range":"60 fect","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"0","ritual":false,"spellAttack":true,"spellcastingAbility":"charisma","source":null},{"name":"Sacred Flame","description":"Flame-like radiance descends on a creature that you can see within range. The target must succeed on a Dexterity saving throw or take 1d8 radiant damage. The target gains no benefit from cover for this saving throw. The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).","school":"evocation","castTime":"1 action","range":"60 feet","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"0","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Spare The Dying","description":"You touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on undead or constructs.","school":"necromancy","castTime":"1 action","range":"Touch","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"0","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Guidance","description":"You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends.","school":"divination","castTime":"1 action","range":"Touch","concentration":true,"duration":"up to 1 minute","components":["V","S"],"material":"","minimumLevel":"0","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null}],"1":[{"name":"Burning Hands","description":"As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one. The fire ignites any flammable objects in the area that aren't being worn or carried. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above Ist.","school":"evocation","castTime":"1 action","range":"Self (15-foot cone)","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma","source":null},{"name":"Shield","description":"An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.","school":"abjuration","castTime":"1 reaction, which you take when you are hit by an attack or targeted by the magic missile spell","range":"Self","concentration":false,"duration":"1 round","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma","source":null},{"name":"Bane","description":"Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roil or saving throw. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above Ist.","school":"enchantment","castTime":"1 action","range":"30 feet","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"a drop of blood","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Healing Word","description":"A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d4 for each slot level above Ist.","school":"evocation","castTime":"1 bonus action","range":"60 feet","concentration":false,"duration":"Instantaneous","components":["V"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Detect Magic","description":"For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.","school":"divination","castTime":"1 action","range":"Self","concentration":true,"duration":"up to 10 minutes","components":["V","S"],"material":"","minimumLevel":"1","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Cure Wounds","description":"A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st.","school":"evocation","castTime":"1 action","range":"Touch","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Bless","description":"You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll ad4 and add the number rolled to the attack roll or saving throw. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above Ist.","school":"enchantment","castTime":"1 action","range":"30 feet","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"a sprinkling of holy water","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Command","description":"You speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn. The spell has no effect if the target is undead, if it doesn't understand your language, or if your command is directly harmful to it. Some typical commands and their effects follow. You might issue a command other than one described here. If you do so, the DM determines how the target behaves. If the target can't follow your command, the spell ends. Approach. The target moves toward you by the shortest and most direct route, ending its turn if it moves within 5 feet of you. Drop. The target drops whatever it is holding and then ends its turn. Flee, The target spends its turn moving away from you by the fastest available means. Grovel. The target falls prone and then ends its turn. Halt. The target doesn't move and takes no actions. A flying creature stays aloft, provided that it is able to do so. Ifit must move to stay aloft, it flies the minimum distance needed to remain in the air. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.","school":"enchantment","castTime":"1 action","range":"60 fect","concentration":false,"duration":"1 round","components":["V"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Create Or Destroy Water","description":"You either create or destroy water. Create Water, You create up to 10 gallons of clean water within range in an open container. Alternatively, the water falls as rain in a 30-foot cube within range, extinguishing exposed flames in the area. Destroy Water. You destroy up to 10 gallons of water in an open container within range. Alternatively, you destroy fog in a 30-foot cube within range. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you create or destroy 10 additional gallons of water, or the size of the cube increases by 5 feet, for each slot level above Ist.","school":"transmutation","castTime":"1 action","range":"30 feet","concentration":false,"duration":"Instantaneous","components":["V","S","M"],"material":"a drop of water if creating water or a few grains of sand if destroying it","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Detect Evil And Good","description":"For the duration, you know if there is an aberration, celestial, elemental, fey, fiend, or undead within 30 feet of you, as well as where the creature is located. Similarly, you know if there is a place or object within 30 feet of you that has been magically consecrated or desecrated. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.","school":"divination","castTime":"1 action","range":"Self","concentration":true,"duration":"up to 10 minutes","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Detect Poison And Disease","description":"For the duration, you can sense the presence and location of poisons, poisonous creatures, and diseases within 30 feet of you. You also identify the kind of poison, poisonous creature, or disease in each case. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.","school":"divination","castTime":"1 action","range":"Self","concentration":true,"duration":"up to 10 minutes","components":["V","S","M"],"material":"a yew leaf","minimumLevel":"1","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Guiding Bolt","description":"A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above Ist.","school":"evocation","castTime":"1 action","range":"120 feet","concentration":false,"duration":"1 round","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":true,"spellcastingAbility":"wisdom","source":null},{"name":"Inflict Wounds","description":"{ Make a melee spell attack against a creature you can j reach, On a hit, the target takes 3d10 necrotic damage. At Higher Levels. When you cast this spell using a 1 spell slot of 2nd level or higher, the damage increases by 1d10 for each slot level above 1st.","school":"necromancy","castTime":"1 action","range":"Touch","concentration":false,"duration":"1 Instantaneous","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":true,"spellcastingAbility":"wisdom","source":null},{"name":"Protection From Evil And Good","description":"Until the spell ends, one willing creature you touch is protected against certain types of creatures: aberrations, celestials, elementals, fey, fiends, and undead. The protection grants several benefits. Creatures of those types have disadvantage on attack rolls against the target. The target also can't be charmed, frightened, or possessed by them. If the target is already charmed, frightened, or possessed by such a creature, the target has advantage on any new saving throw against the relevant effect.","school":"abjuration","castTime":"1 action","range":"Touch","concentration":false,"duration":"Concentration up to 10 minutes","components":["V","S","M"],"material":"holy water or powdered silver and iron, which the spell consumes","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Purify Food And Drink","description":"All nonmasgical food and drink within a 5-foot-radius sphere centered on a point of your choice within range is purified and rendered free of poison and disease.","school":"transmutation","castTime":"1 action","range":"10 feet","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"1","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Sanctuary","description":"You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from area effects, such as the explosion of a fireball. If the warded creature makes an attack or casts a spell that affects an enemy creature, this spell ends.","school":"abjuration","castTime":"1 bonus action","range":"30 feet","concentration":false,"duration":"1 minute","components":["V","S","M"],"material":"a small silver mirror","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Shield Of Faith","description":"A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration.","school":"abjuration","castTime":"1 bonus action","range":"60 feet","concentration":true,"duration":"up to 10 minutes","components":["V","S","M"],"material":"a small parchment with a bit of holy text written on it","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Charm Person","description":"You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.","school":"enchantment","castTime":"1 action","range":"30 feet","concentration":false,"duration":"1 hour","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null},{"name":"Disguise Self","description":"You make yourself—including your clothing, armor, weapons, and other belongings on your person—-look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can't change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair. To discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.","school":"illusion","castTime":"1 action","range":"Self","concentration":false,"duration":"1 hour","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom","source":null}],"2":[],"3":[],"4":[],"5":[],"6":[],"7":[],"8":[],"9":[]},"abilityScores":{"strength":{"savingThrowProficiency":false,"halfProficiency":false,"name":"Str","score":6,"scoreMax":20,"modifier":{"value":-2}},"dexterity":{"savingThrowProficiency":false,"halfProficiency":false,"name":"Dex","score":16,"scoreMax":20,"modifier":{"value":3}},"constitution":{"savingThrowProficiency":true,"halfProficiency":false,"name":"Con","score":15,"scoreMax":20,"modifier":{"value":2}},"intelligence":{"savingThrowProficiency":false,"halfProficiency":false,"name":"Int","score":14,"scoreMax":20,"modifier":{"value":2}},"wisdom":{"savingThrowProficiency":false,"halfProficiency":false,"name":"Wis","score":18,"scoreMax":20,"modifier":{"value":4}},"charisma":{"savingThrowProficiency":true,"halfProficiency":false,"name":"Cha","score":20,"scoreMax":20,"modifier":{"value":5}}},"proficiency":{"baseBonus":{"value":null},"halfBonus":{"value":null}},"baseStats":{"initiativeBonus":{"base":0,"modifier":{"value":3},"bonus":{"value":0}},"hpMax":{"base":8,"modifier":{"value":2},"bonus":{"value":14}},"passivePerception":{"base":10,"modifier":{"value":4},"bonus":{"value":0}},"passiveInvestigation":{"base":10,"modifier":{"value":2},"bonus":{"value":0}},"passiveInsight":{"base":10,"modifier":{"value":4},"bonus":{"value":0}}},"skills":{"acrobatics":{"ability":"dexterity","modifier":{"value":3},"proficient":false,"expertise":false,"bonus":{"value":0}},"animal handling":{"ability":"wisdom","modifier":{"value":4},"proficient":false,"expertise":false,"bonus":{"value":0}},"arcana":{"ability":"intelligence","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":0}},"athletics":{"ability":"strength","modifier":{"value":-2},"proficient":false,"expertise":false,"bonus":{"value":0}},"deception":{"ability":"charisma","modifier":{"value":5},"proficient":true,"expertise":false,"bonus":{"value":0}},"history":{"ability":"intelligence","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":0}},"insight":{"ability":"wisdom","modifier":{"value":4},"proficient":true,"expertise":false,"bonus":{"value":0}},"intimidation":{"ability":"charisma","modifier":{"value":5},"proficient":false,"expertise":false,"bonus":{"value":0}},"investigation":{"ability":"intelligence","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":0}},"medicine":{"ability":"wisdom","modifier":{"value":4},"proficient":false,"expertise":false,"bonus":{"value":0}},"nature":{"ability":"intelligence","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":0}},"perception":{"ability":"wisdom","modifier":{"value":4},"proficient":false,"expertise":false,"bonus":{"value":0}},"performance":{"ability":"charisma","modifier":{"value":5},"proficient":false,"expertise":false,"bonus":{"value":0}},"persuasion":{"ability":"charisma","modifier":{"value":5},"proficient":true,"expertise":false,"bonus":{"value":0}},"religion":{"ability":"intelligence","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":0}},"sleight of hand":{"ability":"dexterity","modifier":{"value":3},"proficient":false,"expertise":false,"bonus":{"value":0}},"stealth":{"ability":"dexterity","modifier":{"value":3},"proficient":true,"expertise":false,"bonus":{"value":0}},"survival":{"ability":"wisdom","modifier":{"value":4},"proficient":false,"expertise":false,"bonus":{"value":0}}},"hitDie":{"d6":1,"d8":1},"attacks":[{"name":"Dagger","attackBonus":{"ability":{"value":3},"proficient":true,"itemBonus":{"value":0}},"dice":"1d4","damageType":"Piercing","damageBonus":{"value":3}}],"armorClasses":[{"name":"Base","base":10,"modifier":[{"value":3}],"bonus":{"value":0}}],"speeds":[{"name":"Base Speed","base":{"value":30},"bonus":{"value":0}}],"notes":[],"size":"Medium","level":null,"spellcasting":[{"title":"SORCERER","spellSave":{"base":8,"proficiency":{"value":null},"modifier":{"value":5}},"spellAttack":{"proficiency":{"value":null},"modifier":{"value":5}}},{"title":"CLERIC","preparedSpells":{"level":{"value":2},"modifier":{"value":4}},"spellSave":{"base":8,"proficiency":{"value":null},"modifier":{"value":4}},"spellAttack":{"proficiency":{"value":null},"modifier":{"value":4}}}]},"race":{"name":"Tiefling","age":"100 years","speed":30,"size":"Medium","languages":[{"title":"Common","description":"The language of the realm - spoken by all races."},{"title":"Infernal","description":"The language of the Devils (Lawful Evil)."}],"traits":[{"title":"Darkvision","description":"You can see in dim light within 60 feet of you as if it were bright light, and within darkness as if it was dim light."},{"title":"Hellish Resistance","description":"You have resistance to fire damage."},{"title":"Infernal Legacy","description":"You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell once per day as a 2nd-level spell. Once you reach 5th level, you can also cast the darkness spell once per day. Charisma is your spellcasting ability for these spells."}],"weaponProficiencies":[],"armorProficiencies":[],"toolProficiencies":[],"abilitiesAtLevels":{}},"background":{"name":"Criminal","skillProficiencies":["deception","stealth"],"languages":[],"toolProficiencies":["Thieves' Tools","Playing card set"],"equipment":["CROWBAR","CLOTHES, COMMON"],"toolKits":[],"gp":15,"features":[{"title":"Criminal Contact","description":"You have a reliable and trustworthy contact who act as your liaison to a network of other criminals. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."}]}}