{
  "title": "Swarmkeeper", 
  "description": "Feeling a deep connection to the environment around them, some rangers reach out through their magical connection to the world and bond with a swarm of nature spirits. The swarm becomes a potent force in battle, as well as helpful company for the ranger. Some Swarmkeepers are outcasts or hermits, keeping to themselves and their attendant swarms rather than dealing with the discomfort of others. Other Swarmkeepers enjoy building vibrant communities that work for the mutual benefit of all those they consider part of their swarm.", 
  "features": {
    "3": {
      "GATHERED SWARM": {
        "title": "Gathered Swarm", 
        "description": "A swarm of intangible nature spirits has bonded itself to you and can assist you in battle. Until you die, the swarm remains in your space, crawling on you or flying and skittering around you within your space. You determine its appearance, or you generate its appearance by rolling on the Swarm Appearance table.\nOnce on each of your turns, you can cause the swarm to assist you in one of the following ways, immediately after you hit a creature with an attack:\nThe attack's target takes 1d6 piercing damage from the swarm.\nThe attack's target must succeed on a Strength saving throw against your spell save DC or be moved by the swarm up to 15 feet horizontally in a direction of your choice.\nYou are moved by the swarm 5 feet horizontally in a direction of your choice."
      }, 
      "SWARMKEEPER MAGIC": {
        "title": "Swarmkeeper Magic", 
        "description": "You learn the mage hand cantrip if you don't already know it. When you cast it, the hand takes the form of your swarming nature spirits.\nYou also learn an additional spell of 1st level or higher when you reach certain levels in this class, as shown in the Swarmkeeper Spells table. Each spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know."
      }
    }, 
    "7": {
      "WRITHING TIDE": {
        "title": "Writhing Tide", 
        "description": "You can condense part of your swarm into a focused mass that lifts you up. As a bonus action, you gain a flying speed of 10 feet and can hover. This effect lasts for 1 minute or until you are incapacitated.\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      }
    }, 
    "11": {
      "MIGHTY SWARM": {
        "title": "Mighty Swarm", 
        "description": "Your Gathered Swarm grows mightier in the following ways:\nThe damage of Gathered Swarm increases to 1d8.\nIf a creature fails its saving throw against being moved by Gathered Swarm, you can also cause the swarm to knock the creature prone.\nWhen you are moved by Gathered Swarm, it gives you half cover until the start of your next turn."
      }
    }, 
    "15": {
      "SWARMING DISPERSAL": {
        "title": "Swarming Dispersal", 
        "description": "You can discorporate into your swarm, avoiding danger. When you take damage, you can use your reaction to give yourself resistance to that damage. You vanish into your swarm and then teleport to an unoccupied space that you can see within 30 feet of you, where you reappear with the swarm.\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      }
    }
  }
}