{
    "title": "Alchemist", 
    "description": "An Alchemist is an expert at combining reagents to produce mystical effects. Alchemists use their creations to give life and to leech it away. Alchemy is the oldest of artificer traditions, and its versatility has long been valued during times of war and peace.", 
    "features": {
      "3": {
        "EXPERIMENTAL ELIXIR": {
          "title": "Experimental Elixir", 
          "description": "Whenever you finish a long rest, you can magically produce an experimental elixir in an empty flask you touch. Roll on the Experimental Elixir table for the elixir's effect, which is triggered when someone drinks the elixir. As an action, a creature can drink the elixir or administer it to an incapacitated creature. You can create additional experimental elixirs by expending a spell slot of 1st level or higher for each one. When you do so, you use your action to create the elixir in an empty flask you touch, and you choose the elixir's effect from the Experimental Elixir table. Creating an experimental elixir requires you to have alchemist supplies on your person, and any elixir you create with this feature lasts until it is drunk or until the end of your next long rest. When you reach certain levels in this class, you can make more elixirs at the end of a long rest: two at 6th level and three at 15th level. Roll for each elixir's effect separately. Each elixir requires its own flask. \nElixir Table: \n1: Healing. The drinker regains a n umber of hit points equal to 2d4 + your Intelligence modifier. \n2: Swiftness. The drinker's walking speed increases by 10 feet for 1 hour. \n3:Resilience. The drinker gains a +1 bonus to AC for 10 minutes. \n4: Boldness. The drinker can roll a d4 and add the number rolled to every attack roll and saving throw they make for the next minute. \n5: Flight. The drinker gains a flying speed of 10 feet for 10 minutes. \n6: Transformation. The drinker's body is transformed as if by the alter self spell. The drinker determines the transformation caused by the spell, the effects of which last for 10 minutes."
        }
      }, 
      "5": {
        "ALCHEMICAL SAVANT": {
          "title": "Alchemical Savant", 
          "description": "You've developed masterful command of magical chemicals, enhancing the healing and damage you create through them. Whenever you cast a spell using your alchemist's supplies as the spellcasting focus, you gain a bonus to one roll of the spell. That roll must restore hit points or be a damage roll that deals acid, fire, necrotic, or poison damage, and the bonus equals your Intelligence modifier (minimum of +1)."
        }
      }, 
      "9": {
        "RESTORATIVE REAGANTS": {
          "title": "Restorative Reagants", 
          "description": "You can incorporate restorative reagents into some of your works: \n• Whenever a creature drinks an experimental elixir you created, the creature gains temporary hit points equal to 2d6 + your Intelligence modifier (minimum of 1 temporary hit point). \n• You can cast lesser restoration without expending a spell slot and without preparing the spell, provided you use alchemist's supplies as the spellcasting focus. You can do so a number of times equal to your Intelligence modifier (minimum of once), and you regain all expended uses when you finish a long rest."
        }
      }, 
      "15": {
        "CHEMICAL MASTERY": {
          "title": "Chemical Mastery", 
          "description": "You have been exposed to so many chemicals that they pose little risk to you, and you can use them to quickly end certain ailments: \n• You gain resistance to acid damage and poison damage, and you are immune to the poisoned condition. \n• You can cast greater restoration and heal without expending a spell slot, without preparing the spell, and without material components, provided you use alchemist's supplies as the spellcasting focus. Once you cast ·either spell with this feature, you can't cast that spell with it again until you finish a long rest."
        }
      }
    }
  }