{
  "title": "The Fiend", 
  "description": "You have made a pact with a fiend from the lower planes of existence, a being w hose aims are evil, even if you strive against those aims. Such beings desire the corruption or destruction of all things, ultimately including you. Fiends powerful enough to forge a pact include demon lords such as Demogorgon, Orcus, Fraz’Urb-luu, and Baphomet; archdevils such as Asmodeus, Dispater, Mephistopheles, and Belial; pit fiends and balors that are especially mighty; and ultroloths and other lords of the yugoloths.", 
  "features": { 
    "1": {
      "DARK ONE'S BLESSING": {
        "title": "Dark One's Blessing", 
        "description": "Starting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1)."
      }
    }, 
    "6": {
      "DARK ONE'S OWN LUCK": {
        "title": "Dark One's Own Luck", 
        "description": "Starting at 6th level, you can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add a d 10 to your roll. You can do so after seeing the initial roll but before any o f the roll’s effects occur.\nOnce you use this feature, you can’t use it again until you finish a short or long rest."
      }
    }, 
    "10": {
      "FIENDISH RESILIENCE": {
        "title": "Fiendish Resilience", 
        "description": "Starting at 10th level, you can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Dam age from magical weapons or silver weapons ignores this resistance."
      }
    }, 
    "14": {
      "HURL THROUGH HELL": {
        "title": "Hurl Through Hell", 
        "description": "Starting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape.\nAt the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience.\nOnce you use this feature, you can’t use it again until you finish a long rest."
      }
    }
  }
}