{
    "DARKVISION": {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light, and within darkness as if it was dim light."
    },
    "FIRE RESISTANCE": {
        "title": "Fire Resistance",
        "description": "You have resistance to fire damage."
    },
    "REACH TO THE BLAZE": {
        "title": "Reach to the Blaze",
        "description": "You know the produce flame cantrip. Once you reach 3rd level, you can cast the burning hands spell once with this trait as a 1st-level spell, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for these spells."
    },
    "ACID RESISTANCE": {
        "title": "Acid Resistance",
        "description": "You have resistance to acid damage."
    },
    "AMPHIBIOUS": {
        "title": "Amphibious",
        "description": "You can breathe air and water."
    },
    "SWIM": {
        "title": "Swim",
        "description": "You have a swimming speed of 30 feet."
    },
    "CALL TO THE WAVE": {
        "title": "Call to the Wave",
        "description": "You know the shape water cantrip. When you reach 3rd level, you can cast the create or destroy water spell as a 2nd-level spell once with this trait, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for these spells."
    },
    "UNENDING BREATH": {
        "title": "Unending Breath",
        "description": "You can hold your breath indefinitely while you're not incapacitated."
    },
    "MINGLE WITH THE WIND": {
        "title": "Mingle With The Wind",
        "description": "You can cast the Leviatate spell once with this trait, requiring no material components, and you regain the ability to cast it this way when you finish a long rest.  Constitution is your spellcasting ability for this spell."
    },
    "EARTH WALK": {
        "title": "Earth Walk",
        "description": "You can move across difficult terrain made of earth or stone without expending extra movement."
    },
    "MERGE WITH STONE": {
        "title": "Merge With Stone",
        "description": "You can cast the Pass Without Trace spell once with this trait, requiring no material components, and you regain the ability to cast it this way when you finish a long rest.  Constitution is your spellcasting ability for this spell."
    }
}