{"playerClasses":{"Bard":{"equipmentPack":"SCHOLAR","level":{"value":3},"name":"Bard","languages":[],"skillProficiencies":["persuasion","insight","history"],"weaponProficiencies":["Simple","Crossbow, hand","Longsword","Rapier","Shortsword"],"armorProficiencies":["Light"],"toolProficiencies":["Drum","Lyre","Flute"],"weapons":["RAPIER","DAGGER"],"armor":["LEATHER"],"equipment":[],"toolKits":["DRUM"],"lvlOneParams":{"isNoInput":false,"spellSelection":["MESSAGE","VICIOUS MOCKERY","HEALING WORD","THUNDERWAVE","ILLUSORY SCRIPT","DISSONANT WHISPERS"]},"hitDie":"d8","savingThrowProficiencies":["dexterity","charisma"],"features":[],"hpBase":8,"abilitiesAtLevels":{},"subclass":{"title":"VALOR","subclassDictionary":{"LORE":{},"VALOR":{}}}},"Ranger":{"equipmentPack":"","level":{"value":2},"name":"Ranger","languages":[],"skillProficiencies":["perception"],"weaponProficiencies":["Simple","Martial"],"armorProficiencies":["Light","Medium","Shield"],"toolProficiencies":[],"weapons":[],"armor":[],"equipment":[],"toolKits":[],"lvlOneParams":{"isNoInput":false,"favoredEnemy":"White People","favoredTerrain":"Cities"},"hitDie":"d10","savingThrowProficiencies":[],"features":[],"hpBase":10,"abilitiesAtLevels":{}}},"levels":{"Bard":{"value":3},"Ranger":{"value":2}},"featLevels":[4,8,12,16,19],"name":"Alaiyo","character":{"level":{"totalLevel":5},"speed":{"value":30},"inventory":{"weapons":[{"name":"Rapier","weaponType":"Martial Melee","cost":"25gp","damage":"1d8","damageType":"Piercing","weight":"2lb","properties":["Finesse"]},{"name":"Dagger","weaponType":"Simple Melee","cost":"2gp","damage":"1d4","damageType":"Piercing","weight":"1lb","properties":["Finesse","Light","Thrown","Range 20ft / 60ft Disadvantage"]}],"armor":[{"name":"Leather","armorType":"Light","cost":"10 gp","AC":{"base":11,"modifier":{"value":3},"bonus":{"value":0}},"strengthPrequisite":0,"stealthDisadvantage":false,"weight":"10 lb"}],"toolKits":[{"name":"Drum","kit":"Musical instrument","cost":"6 gp","weight":"3 lb","description":"Several of the most common types of musical instruments are shown on the table as examples. If you have proficiency with a given musical instrument, you can add your proficiency bonus to any ability checks you make to play music with the instrument. A bard can use a musical instrument as a spellcasting focus, as described in chapter 10. Each type of musical instrument requires a separate proficiency."},{"name":"Disguise kit","kit":"Disguise kit","cost":"25 gp","weight":"3 lb","description":"This pouch of cosmetics, hair dye, and small props lets you create disguises that change your physical appearance. Proficiency with this kit lets you add your proficiency bonus to any ability checks you make to create a visual disguise."}],"items":[{"name":"Backpack","itemType":"Container","quantity":1,"cost":"2 gp","weight":"5 lb","description":"1 cubic foot/30 pounds of gear"},{"name":"Book","itemType":"","quantity":1,"cost":"25 gp","weight":"5 lb","description":"A book might contain poetry, historical accounts, information pertaining to a particular field of lore, diagrams and notes on gnomish contraptions, or just about anything else that can be represented using text or pictures. A book of spells is a spellbook (described later in this section)."},{"name":"Ink (1 ounce bottle)","itemType":"","quantity":1,"cost":"10 gp","weight":"","description":""},{"name":"Ink pen","itemType":"","quantity":1,"cost":"2 cp","weight":"","description":""},{"name":"Parchment (one sheet)","itemType":"","quantity":10,"cost":"1 sp","weight":"","description":""},{"name":"Clothes, fine","itemType":"","quantity":1,"cost":"15 gp","weight":"6 lb","description":""}],"gp":15},"traits":{"armorProficiencies":["Light","Light","Medium","Shield"],"weaponProficiencies":["Simple","Crossbow, hand","Longsword","Rapier","Shortsword","Simple","Martial"],"toolProficiencies":["Drum","Lyre","Flute","Disguise Kit","Forgery Kit"],"languages":[{"title":"Common","description":"The language of the realm - spoken by all races."},{"title":"Infernal","description":"The language of the Devils (Lawful Evil)."}],"features":[{"title":"Darkvision","description":"You can see in dim light within 60 feet of you as if it were bright light, and within darkness as if it was dim light."},{"title":"Hellish Resistance","description":"You have resistance to fire damage."},{"title":"Infernal Legacy","description":"You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell once per day as a 2nd-level spell. Once you reach 5th level, you can also cast the darkness spell once per day. Charisma is your spellcasting ability for these spells."},{"description":"You can inspire others through stirring words or music. To do so, you use a bonus action your turn to choose one creature other than yourself within 60 feat of you who can hear you. That creature gains one Bardic Inspiration die, a d6.\nOnce within the next ten minutes, the creature can roll the die and add the number rolled to one ability check, attack  roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.\nYou can use this feature a number of times equal to your Charisma modifier (minimum of once). You regain any expended uses when you finish a long rest.\nYour Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level.","title":"Bardic Inspiration"},{"title":"False Identity","description":"You have created a second identity that includes documentation, established acquintances, and disguises that allow you to assume that persona, Additionally, you can forge documents including official papers and personal letters, as long as you have seen an example of the kind of document or the handwriting you are trying to copy."},{"title":"Con of Your Choice","description":"Ten stoppered bottles filled colored liquid, a set of weighted diece, or a signet ring of an imaginary duke.)"},{"description":"You can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus.","title":"Jack of All Trades"},{"description":"You can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest, each of those creatures regains an extra 1d6 hit points.\nThe extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level.","title":"Song of Rest"},{"title":"Combat Inspiration","description":"You learn to inspire others in battle. A creature that has a Bardic Inspiration die from you can roll that die and add the number rolled to a weapon damage roll it just made. Alternative, when an attack roll is made against the creature, it can use its reaction to roll the Bardic Inspiration die and add the number rolled to its AC against that attack, after seeing the roll but before knowing whether it hits or misses."},{"description":"Choose two of your skill proficiencies. Your proficiency bonus is doubled for any abiility check you make that uses either of the chosen proficiencies.\nAt 10th level, you choose another two skill proficiencies to gain this benefit.","title":"Expertise","choices":["history","insight"]},{"title":"Favored Enemy","description":"Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. Choose a type of favored enemy. You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all.","choices":["White People"]},{"title":"Natural Explorer","description":"You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in. While traveling for an hour or more in your favored terrain, you gain the following benefits:  - Difficult terrain doesn’t slow your group’s travel.  - Your group can’t become lost except by magical means.  -  Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.  - If you are traveling alone, you can move stealthily at a normal pace.  -  When you forage, you find twice as much food as you normally would.  - While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area.","choices":["Cities"]},{"title":"Archery","description":"You gain a +2 bonus to attack rolls you make with your ranged weapons"}],"resources":[{"title":"Bardic Inspiration","description":"Number of times you can give Bardic Inspiration per long rest. Dice is Bardic Inspiration die.","resourceMax":{"value":5},"dice":"1d6"},{"title":"First Level Spell Slots","description":"Number of first level spells you can cast","resourceMax":{"value":4}},{"title":"Second Level Spell Slots","description":"Number of second level spells you can cast","resourceMax":{"value":3}}],"scalingEffects":[{"title":"Song of Rest","description":"Dice used for Song of Rest.","dice":"1d6"}]},"spells":{"0":[{"name":"Thaumaturgy","description":"You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range: Your voice booms up to three times as loud as normal for 1 minute. You cause flames to flicker, brighten, dim, or change color for 1 minute. You cause harmless tremors in the ground for 1 minute. You create an instantaneous sound that originates from a point of your choice within range, such asa rumble of thunder, the cry of a raven, or ominous whispers. You instantaneously cause an unlocked door or win- dow to fly open or slam shut. You alter the appearance of your eyes for 1 minute. If you cast this spell multiple times, you can have up to three of its -minute effects active at a time, and you can dismiss such an effect as an action.","school":"transmutation","castTime":"1 action","range":"30 feet","concentration":false,"duration":"Up to 1 minute","components":["V"],"material":"","minimumLevel":"0","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma"},{"name":"Message","description":"You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear, You can cast this spell through solid objects if you are familtar with the target and know it is beyond the barrier. Magical silence. 1 foot of stone, 1 inch of common metal. a thin sheet of lead, or 3 feet of wood blocks the spell. The spell doesn't have to follow a straight line and can travel freely around corners or through openings.","school":"transmutation","castTime":"1 action","range":"120 feet","concentration":false,"duration":"1 round","components":["V","S","M"],"material":"a short piece of copper wire","minimumLevel":"0","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma"},{"name":"Vicious Mockery","description":"You unleash a string of insults laced with subtle enchantments at a creature you can see within range. If the target can hear you (though it need not understand you), it must succeed on a Wisdom saving throw or take 1d4 psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn. This spell's damage increases by 1d4 when you reach Sth level (2d4), 11th level (3d4), and 17th level (4d4).","school":"enchantment","castTime":"1 action","range":"60 feet","concentration":false,"duration":"Instantaneous","components":["V"],"material":"","minimumLevel":"0","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma"}],"1":[{"name":"Healing Word","description":"A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d4 for each slot level above Ist.","school":"evocation","castTime":"1 bonus action","range":"60 feet","concentration":false,"duration":"Instantaneous","components":["V"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma"},{"name":"Thunderwave","description":"A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed. In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell's effect, and the spell emits a thunderous boom audible out to 300 feet. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above Ist.","school":"evocation","castTime":"1 action","range":"Self (15-foot cube)","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma"},{"name":"Illusory Script","description":"You write on parchment, paper, or some other suitable writing material and imbue it with a potent illusion that lasts for the duration. To you and any creatures you designate when you cast the spell, the writing appears normal, written in your hand, and conveys whatever meaning you intended when you wrote the text. To all others, the writing appears as if it were written in an unknown or magical script that is unintelligible. Alternatively, you can cause the writing to appear to be an entirely different message, written in a different hand and language, though the language must be one you know. Should the spell be dispelled, the original script and the illusion both disappear. A creature with truesight can read the hidden message.","school":"illusion","castTime":"1 minute","range":"Touch","concentration":false,"duration":"10 days","components":["S","M"],"material":"a lead-based ink worth at least 10 gp. which the spell consumes","minimumLevel":"1","ritual":true,"spellAttack":false,"spellcastingAbility":"charisma"},{"name":"Dissonant Whispers","description":"| | You whisper a discordant melody that only one creature of your choice within range can hear, wracking it with terrible pain. The target must make a Wisdom saving throw. On a failed save, it takes 3d6 psychic damage and must immediately use its reaction, if available, to move as far as its speed allows away from you. The creature doesn't move into obviously dangerous ground, such as a fire or a pit. On a successful save, the target takes | half as much damage and doesn't have to move away. A deafened creature automatically succeeds on the save. At Higher Levels, When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above Ist. —","school":"enchantment","castTime":"1 action","range":"60 feet","concentration":false,"duration":"} Instantaneous","components":["V"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma"},{"name":"Unseen Servant","description":"This spell creates an invisible, mindless, shapeless force that performs simple tasks at your command until the spell ends. The servant springs into existence in an unoccupied space on the ground within range. It has AC 10, 1 hit point, and a Strength of 2, and it can't attack. If it drops to 0 hit points, the spell ends. Once on each of your turns as a bonus action, you can mentally command the servant to move up to 15 feet and interact with an object. The servant can perform simple tasks that a human servant could do, such as fetching things, cleaning, mending, folding clothes, lighting fires, serving food, and pouring wine. Once you give the command, the servant performs the task to the best of its ability until it completes the task, then waits for your next command. If you command the servant to perform a task that would move it more than 60 feet away from you, the spell ends.","school":"conjuration","castTime":"1 action","range":"60 feet","concentration":false,"duration":"1 hour","components":["V","S","M"],"material":"a piece of string and a bit of wood","minimumLevel":"1","ritual":true,"spellAttack":false,"spellcastingAbility":"charisma"},{"name":"Hellish Rebuke","description":"You point your finger, and the creature that damaged you is momentarily surrounded by hellish flames. The creature must make a Dexterity saving throw, It takes 2d10 fire damage on a failed save, or half as much damage on a successful one. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10 for each slot level above 1st.","school":"evocation","castTime":"1 reaction, which you take in response to being damaged by a creature within 60 feet of you that you can see","range":"60 feet","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma"}],"2":[{"name":"Detect Thoughts","description":"For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you, If the creature you choose has an Intelligence of 3 or lower or doesn't speak any language, the creature is unaffected. You initially learn the surface thoughts of the creature what is most on its mind in that moment. As an action, you can either shift your attention to another creature's thoughts or attempt to probe deeper into the same creature's mind. If you probe deeper, the target must make a Wisdom saving throw. Ifit fails, you gain insight into its reasoning (if any), its emotional state, and something that looms large in its mind (such as something it worries over, loves, or hates), If it succeeds, the spell ends. Either way, the target knows that you are probing into its mind, and unless you shift your attention to another creature's thoughts, the creature can use its action on its turn to make an Intelligence check contested by your Intelligence check; if it succeeds, the spell ends. Questions verbally directed at the target creature naturally shape the course of its thoughts, so this spell is particularly effective as part of an interrogation. You can also use this spell to detect the presence of thinking creatures you can't see. When you cast the spell or as your action during the duration, you can search for thoughts within 30 feet of you. The spell can penetrate barriers, but 2 feet of rock, 2 inches of any metal other than lead, or a thin sheet of lead blocks you. You can't detect a creature with an Intelligence of 3 or lower or one that doesn't speak any language. Once you detect the presence of a creature in this way, you can read its thoughts for the rest of the duration as described above, even if you can't see it, but it must stil! be within range.","school":"divination","castTime":"1 action","range":"Self","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"a copper piece","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"charisma"},{"name":"Aid","description":"Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, a target's hit points increase by an additional 5 for each slot level above 2nd.","school":"abjuration","castTime":"1 action","range":"30 feet","concentration":false,"duration":"8 hours","components":["V","S","M"],"material":"a tiny strip of white cloth","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"}],"3":[],"4":[],"5":[],"6":[],"7":[],"8":[],"9":[]},"abilityScores":{"strength":{"savingThrowProficiency":false,"name":"Str","score":14,"scoreMax":20,"modifier":{"value":2}},"dexterity":{"savingThrowProficiency":true,"name":"Dex","score":17,"scoreMax":20,"modifier":{"value":3}},"constitution":{"savingThrowProficiency":false,"name":"Con","score":10,"scoreMax":20,"modifier":{"value":0}},"intelligence":{"savingThrowProficiency":false,"name":"Int","score":12,"scoreMax":20,"modifier":{"value":1}},"wisdom":{"savingThrowProficiency":false,"name":"Wis","score":15,"scoreMax":20,"modifier":{"value":2}},"charisma":{"savingThrowProficiency":true,"name":"Cha","score":20,"scoreMax":20,"modifier":{"value":5}}},"proficiency":{"baseBonus":{"value":2},"halfBonus":{"value":1}},"baseStats":{"initiativeBonus":{"base":0,"modifier":{"value":3},"bonus":{"value":0}},"baseArmorClass":{"base":10,"modifier":{"value":3},"bonus":{"value":0}},"hpMax":{"base":10,"modifier":{"value":0},"bonus":{"value":12}},"passivePerception":{"base":10,"modifier":{"value":2},"bonus":{"value":0}},"passiveInvestigation":{"base":10,"modifier":{"value":1},"bonus":{"value":0}},"passiveInsight":{"base":10,"modifier":{"value":2},"bonus":{"value":0}}},"skills":{"acrobatics":{"ability":"dexterity","modifier":{"value":3},"proficient":false,"expertise":false,"bonus":{"value":1}},"animal handling":{"ability":"wisdom","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":1}},"arcana":{"ability":"intelligence","modifier":{"value":1},"proficient":false,"expertise":false,"bonus":{"value":1}},"athletics":{"ability":"strength","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":1}},"deception":{"ability":"charisma","modifier":{"value":5},"proficient":true,"expertise":false,"bonus":{"value":0}},"history":{"ability":"intelligence","modifier":{"value":1},"proficient":true,"expertise":true,"bonus":{"value":0}},"insight":{"ability":"wisdom","modifier":{"value":2},"proficient":true,"expertise":true,"bonus":{"value":0}},"intimidation":{"ability":"charisma","modifier":{"value":5},"proficient":false,"expertise":false,"bonus":{"value":1}},"investigation":{"ability":"intelligence","modifier":{"value":1},"proficient":false,"expertise":false,"bonus":{"value":1}},"medicine":{"ability":"wisdom","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":1}},"nature":{"ability":"intelligence","modifier":{"value":1},"proficient":false,"expertise":false,"bonus":{"value":1}},"perception":{"ability":"wisdom","modifier":{"value":2},"proficient":true,"expertise":false,"bonus":{"value":1}},"performance":{"ability":"charisma","modifier":{"value":5},"proficient":false,"expertise":false,"bonus":{"value":1}},"persuasion":{"ability":"charisma","modifier":{"value":5},"proficient":true,"expertise":false,"bonus":{"value":0}},"religion":{"ability":"intelligence","modifier":{"value":1},"proficient":false,"expertise":false,"bonus":{"value":1}},"sleight of hand":{"ability":"dexterity","modifier":{"value":3},"proficient":true,"expertise":false,"bonus":{"value":0}},"stealth":{"ability":"dexterity","modifier":{"value":3},"proficient":false,"expertise":false,"bonus":{"value":1}},"survival":{"ability":"wisdom","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":1}}},"attacks":[{"name":"Rapier","attackBonus":{"ability":{"value":3},"proficient":true,"itemBonus":{"value":0}},"dice":"1d8","damageType":"Piercing","damageBonus":{"value":3}},{"name":"Dagger","attackBonus":{"ability":{"value":3},"proficient":true,"itemBonus":{"value":0}},"dice":"1d4","damageType":"Piercing","damageBonus":{"value":3}}],"armorClasses":[{"name":"Base","base":10,"modifier":[{"value":3}],"bonus":{"value":0}},{"name":"Leather","base":11,"modifier":[{"value":3}],"bonus":{"value":0}}],"speeds":[{"name":"Base Speed","base":{"value":30},"bonus":{"value":0}}],"size":"Medium","spellcasting":[{"title":"BARD","spellSave":{"base":8,"proficiency":{"value":2},"modifier":{"value":5}},"spellAttack":{"proficiency":{"value":2},"modifier":{"value":5}}},{"title":"RANGER","spellSave":{"base":8,"proficiency":{"value":2},"modifier":{"value":2}},"spellAttack":{"proficiency":{"value":2},"modifier":{"value":2}}}],"hitDie":"d10"},"race":{"name":"Tiefling","age":"100 years","speed":30,"size":"Medium","languages":[{"title":"Common","description":"The language of the realm - spoken by all races."},{"title":"Infernal","description":"The language of the Devils (Lawful Evil)."}],"traits":[{"title":"Darkvision","description":"You can see in dim light within 60 feet of you as if it were bright light, and within darkness as if it was dim light."},{"title":"Hellish Resistance","description":"You have resistance to fire damage."},{"title":"Infernal Legacy","description":"You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell once per day as a 2nd-level spell. Once you reach 5th level, you can also cast the darkness spell once per day. Charisma is your spellcasting ability for these spells."}],"weaponProficiencies":[],"armorProficiencies":[],"toolProficiencies":[],"abilitiesAtLevels":{}},"background":{"name":"Charlatan","skillProficiencies":["deception","sleight of hand"],"languages":[],"toolProficiencies":["Disguise Kit","Forgery Kit"],"equipment":["CLOTHES, FINE"],"toolKits":["DISGUISE KIT"],"gp":15,"features":[{"title":"False Identity","description":"You have created a second identity that includes documentation, established acquintances, and disguises that allow you to assume that persona, Additionally, you can forge documents including official papers and personal letters, as long as you have seen an example of the kind of document or the handwriting you are trying to copy."},{"title":"Con of Your Choice","description":"Ten stoppered bottles filled colored liquid, a set of weighted diece, or a signet ring of an imaginary duke.)"}]}}