{"level":{"totalLevel":5},"speed":{"value":30},"inventory":{"weapons":[{"name":"Scimitar","weaponType":"Martial Melee","cost":"25gp","damage":"1d6","damageType":"Slashing","weight":"3lb","properties":["Finesse","Light"]}],"armor":[{"name":"Shield","armorType":"Shield","cost":"10 gp","AC":{"base":10,"modifier":{"value":2},"bonus":{"value":0}},"strengthPrequisite":0,"stealthDisadvantage":false,"weight":"6 lb"},{"name":"Leather","armorType":"Light","cost":"10 gp","AC":{"base":11,"modifier":{"value":2},"bonus":{"value":0}},"strengthPrequisite":0,"stealthDisadvantage":false,"weight":"10 lb"}],"toolKits":[],"items":[{"name":"Backpack","itemType":"Container","quantity":1,"cost":"2 gp","weight":"5 lb","description":"1 cubic foot/30 pounds of gear"},{"name":"Bedroll","itemType":"","quantity":1,"cost":"1 gp","weight":"7 lb","description":""},{"name":"Mess kit","itemType":"","quantity":1,"cost":"2 sp","weight":"1 lb","description":"This tin box contains a cup and simple cutlery. The box clamps together, and one side can be used as a cooking pan and the other as a plate or shallow bowl."},{"name":"Tinderbox","itemType":"","quantity":1,"cost":"5 sp","weight":"1 lb","description":"This small container holds flint, fire steel, and tinder (usually dry cloth soaked in light oil) used to kindle a fire. Using it to light a torch—or anything else with abundant, exposed fuel—takes an action. Lighting any other fire takes 1 minute."},{"name":"Waterskin","itemType":"Container","quantity":1,"cost":"2 sp","weight":"5 lb (full)","description":"4 points liquid"},{"name":"Rope, hempen (50 feet)","itemType":"","quantity":1,"cost":"1 gp","weight":"4 lb","description":"Rope, whether made of hemp or silk, has 2 hit points and can be burst with a DC 17 Strength check."},{"name":"Torch","itemType":"","quantity":10,"cost":"1 cp","weight":"1 lb","description":"A torch burns for 1 hour, providing bright light in a 20-foot radius and dim light for an additional 20 feet. If you make a melee attack with a burning torch and hit, it deals 1 fire damage."},{"name":"Rations (1 day)","itemType":"","quantity":10,"cost":"5 sp","weight":"2 lb","description":"Rations consist of dry foods suitable for extended travel, including jerky, dried fruit, hardtack, and nuts."},{"name":"Crowbar","itemType":"","quantity":1,"cost":"2 gp","weight":"5 lb","description":"Using a crowbar grants advantage to Strength checks where the crowbar's leverage can be applied"},{"name":"Clothes, common","itemType":"","quantity":1,"cost":"5 sp","weight":"3 lb","description":""}],"gp":15},"traits":{"armorProficiencies":["Light","Medium","Shield"],"weaponProficiencies":["Club","Darts","Javelin","Mace","Quarterstaff","Scimitar","Sickle","Sling","Spear"],"toolProficiencies":["Herbalism Kit","Thieves' Tools","Playing Card Set"],"languages":[{"title":"Common","description":"The language of the realm - spoken by all races."},{"title":"Elvish","description":"The language of the Elves."}],"features":[{"title":"Darkvision","description":"You can see in dim light within 60 feet of you as if it were bright light, and within darkness as if it was dim light."},{"title":"Fey Ancestry","description":"You have advantage on saving throws against being charmed, and magic can't put you to sleep."},{"title":"Skill Versatility","description":"You gain proficiency in two skills of your choice. - persuasion, investigation"},{"title":"Extra Language","description":"You can speak, read, and write one extra language of your chotce. - Elvish"},{"title":"Darkvision","description":"You can see in dim light within 60 feet of you as if it were bright light, and within darkness as if it was dim light."},{"title":"Fey Ancestry","description":"You have advantage on saving throws against being charmed, and magic can't put you to sleep."},{"title":"Skill Versatility","description":"You gain proficiency in two skills of your choice. - persuasion, investigation"},{"title":"Extra Language","description":"You can speak, read, and write one extra language of your chotce. - Elvish"},{"title":"Druidic","description":"You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic."},{"title":"Criminal Contact","description":"You have a reliable and trustworthy contact who act as your liaison to a network of other criminals. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."},{"title":"Combat Wild Shape","description":"When you choose this circle at 2nd level, you gain the ability to use Wild Shape on your turn as a bonus action, rather than as an action. Additionally, while you are transformed by Wild Shape, you can use a bonus action to expend one spell slot to regain 1d8 hit points per level of the spell slot expended."},{"title":"Circle Forms","description":"The rites of your circle grant you the ability to transform into more dangerous animal forms. Starting at 2nd level, you can use your Wild Shape to transform into a beast with a challenge rating as high as 1 (you ignorethe Max, CR column of the Beast Shapes table, but mustabide by the other limitations there). Starting at 6th level, you can transform into a beast with a challenge rating as high as your druid level divided by 3, rounded down."},{"title":"Wild Shape","description":"Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\nYour druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.\nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal from earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\nWhile you are transformed, the following rules apply:\nYour game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.\nWhen you transform, you assume the beasts hit points and hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage Carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.\nYou can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as call lightning, that you've already cast.\nYou retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However. you can't use any of your special senses, such as darkvision, unless your new form also has that sense.\nYou choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment. based on the creature’s shape and size. Your equipment doesn’t change size or shape to match the new form, and any equipment that the new form can’t wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form."}],"resources":[{"title":"Wild Shape","description":"Number of times you can Wild Shape","resourceMax":{"value":2}},{"title":"First Level Spell Slots","description":"Number of first level spells you can cast","resourceMax":{"value":4}},{"title":"Second Level Spell Slots","description":"Number of second level spells you can cast","resourceMax":{"value":3}},{"title":"Third Level Spell Slots","description":"Number of third level spells you can cast","resourceMax":{"value":2}}],"scalingEffects":[{"title":"Wild Shape","description":"Max challenge rating of beasts you can Wild Shape into (No flying speed).","challengeRating":1}]},"spells":{"0":[{"name":"Poison Spray","description":"You extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm. The creature must succeed on a Constitution saving throw or take 1d12 poison damage. This spell's damage increases by 1d12 when you reach 5th level (2412), 11th level (3d12), and 17th level (4412).","school":"conjuration","castTime":"1 action","range":"10 feet","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"0","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Produce Flame","description":"A flickering flame appears in your hand. The flame remains there for the duration and harms neither you nor your equipment. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action or if you cast it again. You can also attack with the flame, although doing so ends the spell. When you cast this spell, or as an action ona later turn, you can hurl the flame at a creature within 30 feet of you. Make a ranged spell attack. Ona hit, the target takes 1d8 fire damage. This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).","school":"conjuration","castTime":"1 action","range":"Self","concentration":false,"duration":"10 minutes","components":["V","S"],"material":"","minimumLevel":"0","ritual":false,"spellAttack":true,"spellcastingAbility":"wisdom"},{"name":"Resistance","description":"You touch one willing creature, Once before the spell ends, the target can roll a d4 and add the number rolled to one saving throw of its choice. It can roll the die before or after making the saving throw. The spell then ends.","school":"abjuration","castTime":"1 action","range":"Touch","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"a miniature cloak","minimumLevel":"0","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"}],"1":[{"name":"Charm Person","description":"You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.","school":"enchantment","castTime":"1 action","range":"30 feet","concentration":false,"duration":"| hour","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Animal Friendship","description":"This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spells ends. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional beast for each slot level above Ist.","school":"enchantment","castTime":"1 action","range":"30 feet","concentration":false,"duration":"24 hours","components":["V","S","M"],"material":"a morsel of food","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Speak With Animals","description":"You gain the ability to comprehend and verbally communicate with beasts for the duration. The knowledge and awareness of many beasts is limited by their intelligence, but at minimum, beasts can give you information about nearby locations and monsters, including whatever they can perceive or have perceived within the past day. You might be able to persuade a beast to perform a small favor for you, at the DM's discretion.","school":"divination","castTime":"1 action","range":"Self","concentration":false,"duration":"10 minutes","components":["V","S"],"material":"","minimumLevel":"1","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Healing Word","description":"A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d4 for each slot level above Ist.","school":"evocation","castTime":"1 bonus action","range":"60 feet","concentration":false,"duration":"Instantaneous","components":["V"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Faerie Fire","description":"Each object in a 20-foot cube within range is outlined in blue, green, or violet light (your choice). Any creature in or mineral spheres) the area when the spell is cast is also outlined in light if it fails a Dexterity saving throw. For the duration, objects and affected creatures shed dim light in a 10-foot radius. Any attack roll against an affected creature or object has advantage if the attacker can see it, and the affected creature or object can't benefit from being invisible.","school":"evocation","castTime":"1 action","range":"60 feet","concentration":true,"duration":"up to 1 minute","components":["V"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Detect Magic","description":"For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.","school":"divination","castTime":"1 action","range":"Self","concentration":true,"duration":"up to 10 minutes","components":["V","S"],"material":"","minimumLevel":"1","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Cure Wounds","description":"A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st.","school":"evocation","castTime":"1 action","range":"Touch","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Longstrider","description":"You touch a creature. The target's speed increases by 10 feet until the spell ends. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above Ist.","school":"transmutation","castTime":"1 action","range":"Touch","concentration":false,"duration":"| hour","components":["V","S","M"],"material":"a pinch of dirt","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Thunderwave","description":"A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed. In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell's effect, and the spell emits a thunderous boom audible out to 300 feet. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above Ist.","school":"evocation","castTime":"1 action","range":"Self (15-foot cube)","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Create Or Destroy Water","description":"You either create or destroy water. Create Water, You create up to 10 gallons of clean water within range in an open container. Alternatively, the water falls as rain in a 30-foot cube within range, extinguishing exposed flames in the area. Destroy Water. You destroy up to 10 gallons of water in an open container within range. Alternatively, you destroy fog in a 30-foot cube within range. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you create or destroy 10 additional gallons of water, or the size of the cube increases by 5 feet, for each slot level above Ist.","school":"transmutation","castTime":"1 action","range":"30 feet","concentration":false,"duration":"Instantaneous","components":["V","S","M"],"material":"a drop of water if creating water or a few grains of sand if destroying it","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Detect Poison And Disease","description":"For the duration, you can sense the presence and location of poisons, poisonous creatures, and diseases within 30 feet of you. You also identify the kind of poison, poisonous creature, or disease in each case. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.","school":"divination","castTime":"1 action","range":"Self","concentration":true,"duration":"up to 10 minutes","components":["V","S","M"],"material":"a yew leaf","minimumLevel":"1","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Entangle","description":"Grasping weeds and vines sprout from the ground ina 20-foot square starting from a point within range. For the duration, these plants turn the ground in the area into difficult terrain. A creature in the area when you cast the spell must succeed on a Strength saving throw or be restrained by the entangling plants until the spell ends. A creature restrained by the plants can use its action to make a Strength check against your spell save DC. Ona success, it frees itself. When the spell ends, the conjured plants wilt away.","school":"conjuration","castTime":"1 action","range":"90 feet","concentration":true,"duration":"up to 1 minute","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Fog Cloud","description":"You create a 20-foot-radius sphere of fog centered on a point within range. The sphere spreads around corners, and its area is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the radius of the fog increases by 20 feet for each slot level above lst.","school":"conjuration","castTime":"1 action","range":"120 feet","concentration":true,"duration":"up to 1 hour","components":["V","S"],"material":"","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Goodberry","description":"Up te ten berries appear in your hand and are infused with magic for the duration. A creature can use its action to eat one berry. Eating a berry restores 1 hit point, and the berry provides enough nourishment to sustain a creature for one day. The berries lose their potency if they have not been consumed within 24 hours of the casting of this spell.","school":"transmutation","castTime":"1 action","range":"Touch","concentration":false,"duration":"Instantaneous","components":["V","S","M"],"material":"a sprig of mistlctoe","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Jump","description":"You touch a creature. The creature's jump distance is tripled until the spell ends.","school":"transmutation","castTime":"1 action","range":"Touch","concentration":false,"duration":"1 minute","components":["V","S","M"],"material":"a grasshopper's hind leg","minimumLevel":"1","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Purify Food And Drink","description":"All nonmasgical food and drink within a 5-foot-radius sphere centered on a point of your choice within range is purified and rendered free of poison and disease.","school":"transmutation","castTime":"1 action","range":"10 feet","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"1","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"}],"2":[{"name":"Animal Messenger","description":"By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as “a man or woman dressed in the uniform of the town guard” or “a red-haired dwarf wearing a pointed hat.” You also speak a message of up to twenty-five words. The target beast travels for the duration of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals. When the messenger arrives, it delivers your message to the creature that you described, replicating the sound of your voice. The messenger speaks only to a creature matching the description you gave. If the messenger doesn't reach its destination before the spell ends, the message is lost, and the beast makes its way back to where you cast this spell. At Higher Levels. If you cast this spell using a spell slot of 3nd level or higher, the duration of the spell increases by 48 hours for each slot level above 2nd.","school":"enchantment","castTime":"1 action","range":"30 feet","concentration":false,"duration":"24 hours","components":["V","S","M"],"material":"a morsel of food","minimumLevel":"2","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Heat Metal","description":"Choose a manufactured metal object, such as a metal weapon or a suit of heavy or medium metal armor, that you can see within range. You cause the object to glow red-hot. Any creature in physical contact with the object takes 2d8 fire damage when you cast the spell. Until the spell ends, you can use a bonus action on each of your subsequent turns to cause this damage again. If a creature is holding or wearing the object and takes the damage from it, the creature must succeed on a Constitution saving throw or drop the object if it can. If it doesn't drop the object, it has disadvantage on attack rolls and ability checks until the start of your next turn. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.","school":"transmutation","castTime":"1 action","range":"60 feet","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"a piece of iron and a flame","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Locate Animals Or Plants","description":"Describe or name a specific kind of beast or plant. Concentrating on the voice of nature in your surroundings, you learn the direction and distance to the closest creature or plant of that kind within 5 miles, if any are present.","school":"divination","castTime":"1 action","range":"Self","concentration":false,"duration":"Instantaneous","components":["V","S","M"],"material":"a bit of fur from a bloodhound","minimumLevel":"2","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Lesser Restoration","description":"You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned.","school":"abjuration","castTime":"1 action","range":"Touch","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Hold Person","description":"Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them.","school":"enchantment","castTime":"1 action","range":"60 feet","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"a small, straight piece of iron","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Enhance Ability","description":"You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains that effect until the spell ends. Bear's Endurance. The target has advantage on Constitution checks, It also gains 2d6 temporary hit points, which are lost when the spell ends. Bull's Strength. The target has advantage on Strength checks, and his or her carrying capacity doubles. Cat's Grace. The target has advantage on Dexterity checks. It also doesn't take damage from falling 20 feet or less if it isn't incapacitated. Eagle's Splendor. The target has advantage on Charisma checks. Fox's Cunning. The target has advantage on Intelligence checks. Owl's Wisdom. The target has advantage on Wisdom checks. At Higher Levels. When you cast this spell using a spell slot of 3rd Jevel or higher, you can target one additional creature for each slot level above 2nd.","school":"transmutation","castTime":"1 action","range":"Touch","concentration":true,"duration":"up to 1 hour.","components":["V","S","M"],"material":"fur or a feather from a beast","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Locate Object","description":"Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement. The spell can locate a specific object known to you, as long as you have seen it up closec—within 30 fect—at least once. Alternatively, the spell can locate the nearest object of a particular kind, such as a certain kind of apparel, jewelry, furniture, tool, or weapon. This spell can't locate an object if any thickness of lead, even a thin sheet, blocks a direct path between you and the object.","school":"divination","castTime":"1 action","range":"Self","concentration":true,"duration":"up to 10 minutes","components":["V","S","M"],"material":"a forked twig","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Barkskin","description":"You touch a willing creature. Until the spell ends, the target's skin has a rough, bark-like appearance, and the target's AC can't be less than 16, regardless of what kind of armor it is wearing.","school":"transmutation","castTime":"1 action","range":"Touch","concentration":true,"duration":"up to 1 hour","components":["V","S","M"],"material":"a handful of oak bark","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Beast Sense","description":"You touch a willing beast. For the duration of the spell, you can use your action to see through the beast's eyes and hear what it hears, and continue to do so until you use your action to return to your normal senses. While perceiving through the beast's senses, you gain the benefits of any special senses possessed by that creature, though you are blinded and deafened to your own surroundings.","school":"divination","castTime":"1 action","range":"Touch","concentration":true,"duration":"up to 1 hour","components":["S"],"material":"","minimumLevel":"2","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Darkvision","description":"You touch a willing creature to grant it the ability to see in the dark. For the duration, that creature has darkvision out to a range of 60 feet.","school":"transmutation","castTime":"1 action","range":"Touch","concentration":false,"duration":"§ hours","components":["V","S","M"],"material":"either a pinch of dried carrot or an agate","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Find Traps","description":"You sense the presence of any trap within range that is within line of sight. A trap, for the purpose of this spell, includes anything that would inflict a sudden or unexpected effect you consider harmful or undesirable, which was specifically intended as such by its creator. Thus, the spell would sense an area affected by the alarm spell, a glyph of warding, or a mechanical pit trap, but it would not reveal a natural weakness in the floor, an unstable ceiling, or a hidden sinkhole. This spell merely reveals that a trap is present. You don't learn the location of each trap, but you do learn the general nature of the danger posed by a trap you sense.","school":"divination","castTime":"1 action","range":"120 feet","concentration":false,"duration":"[Instantaneous","components":["V","S"],"material":"","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Flame Blade","description":"You evoke a fiery blade in your free hand. The blade is similar in size and shape to a scimitar, and it lasts for the duration. If you let go of the blade, it disappears, but you can evoke the blade again as a bonus action. You can use your action to make a melee spell attack with the fiery blade. On a hit, the target takes 3d6 fire damage. The flaming blade sheds bright light in a 10-foot radius and dim light for an additional 10 feet. At Higher Levels, When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for every two slot levels above 2nd.","school":"evocation","castTime":"1 bonus action","range":"Self","concentration":true,"duration":"up to 10 minutes","components":["V","S","M"],"material":"leaf of sumac","minimumLevel":"2","ritual":false,"spellAttack":true,"spellcastingAbility":"wisdom"},{"name":"Flaming Sphere","description":"A 5-foot-diameter sphere of fire appears in an unoccupied space of your choice within range and lasts for the duration. Any creature that ends its turn within 5 feet of the sphere must make a Dexterity saving throw. The creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one. As a bonus action, you can move the sphere up to 30 feet. If you ram the sphere into a creature, that creature must make the saving throw against the sphere's damage, and the sphere stops moving this turn. When you move the sphere, you can direct it over barriers up to 5 feet tall and jump it across pits up to 10 feet wide. The sphere ignites flammable objects not being worn or carried, and it sheds bright light in a 20-foot radius and dim light for an additional 20 feet. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.","school":"conjuration","castTime":"1 action","range":"60 feet","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"a bit of tallow, a pinch of brimstone, and a dusting of powdered iron","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Gust Of Wind","description":"A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell's duration. Each creature that starts its turn in the line must succeed on a Strength saving throw or be pushed 15 feet away from you in a direction following the line. Any creature in the line must spend 2 feet of movement for every 1 foot it moves when moving closer to you. The gust disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them. As a bonus action on each of your turns before the spell ends, you can change the direction in which the line blasts from you.","school":"evocation","castTime":"1 action","range":"Self (60-foot line)","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"a legume seed","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Moonbeam","description":"A silvery beam of pale light shines down in a 5-foot- radius, 40-foot-high cylinder centered on a point within range. Until the spell ends, dim light fills the cylinder. When a creature enters the spell's area for the first time on a turn or starts its turn there, it is engulfed in ghostly flames that cause searing pain, and it must make a Constitution saving throw. It takes 2d10 radiant damage on a failed save, or half as much damage ona successful one. A shapechanger makes its saving throw with disadvantage. If it fails, it also instantly reverts to its original form and can't assume a different form until it leaves the spell's light. On each of your turns after you cast this spell, you can use an action to move the beam 60 feet in any direction. At Higher Levels, When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d10 for each slot level above 2nd.","school":"evocation","castTime":"1 action","range":"120 feet","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"several seeds of any moonseed plant and a piece of opalescent feldspar","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Pass Without Trace","description":"A veil of shadows and silence radiates from you, masking you and your companions from detection. For the duration, each creature you choose within 30 feet of you (including you) has a +10 bonus to Dexterity (Stealth) checks and can't be tracked except by magical means. A creature that receives this bonus leaves behind no tracks or other traces of its passage.","school":"abjuration","castTime":"1 action","range":"Self","concentration":true,"duration":"up to 1 hour","components":["V","S","M"],"material":"ashes from a burned leaf of mistletoe and a sprig of spruce","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Protection From Poison","description":"You touch a creature. If it is poisoned, you neutralize the poison. If more than one poison afflicts the target, you neutralize one poison that you know is present, or you neutralize one at random. For the duration, the target has advantage on saving throws against being poisoned, and it has resistance to poison damage.","school":"abjuration","castTime":"1 action","range":"Touch","concentration":false,"duration":"| hour","components":["V","S"],"material":"","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Spike Growth","description":"The ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and thorns. The area becomes difficult terrain for the duration. When a creature moves into or within the area, it takes 2d4 piercing damage for every 5 feet it travels. The transformation of the ground is camouflaged to look natural. Any creature that can't see the area at the time the spell is cast must make a Wisdom (Perception) check against your spell save DC to recognize the terrain as hazardous before entering it.","school":"transmutation","castTime":"1 action","range":"150 feet","concentration":true,"duration":"up to 10 minutes","components":["V","S","M"],"material":"seven sharp thorns or seven small twigs, each sharpened to a point","minimumLevel":"2","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"}],"3":[{"name":"Dispel Magic","description":"Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, | the spell ends. } At Higher Levels. When you cast this spell using a | spell slot of 4th level or higher, you automatically end | the effects of a spell on the target if the spell's level is | | equal to or less than the level of the spell slot you used.","school":"abjuration","castTime":"1 action","range":"| 120 feet","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"3","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Feign Death","description":"You touch a willing creature and put it into a cataleptic state that is indistinguishable from death. For the spell's duration, or until you use an action to touch the target and dismiss the spell. the target appears dead to all outward inspection and to spells used to determine the target's status. The target is blinded and incapacitated, and its speed drops to 0. The target has resistance to all damage except psychic damage. If the target is diseased or poisoned when you cast the spell, or becomes diseased or poisoned while under the spell's effect, the disease and poison have no effect until the spell ends.","school":"necromancy","castTime":"1 action","range":"Touch","concentration":false,"duration":"1 hour","components":["V","S","M"],"material":"a pinch of graveyard dirt","minimumLevel":"3","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Plant Growth","description":"This spell channels vitality into plants within a specific area. There are two possible uses for the spell, granting either immediate or long-term benefits. If you cast this spell using 1 action, choose a point within range. All normal plants in a 100-foot radius centered on that point become thick and overgrown. A creature moving through the area must spend 4 feet of movement for every 1 foot it moves. You can exclude one or more areas of any size within the spell's area from being affected. If you cast this spell over 8 hours, you enrich the land, All plants in a half-mile radius centered on a point within range become enriched for 1 year. The plants yield twice the normal amount of food when harvested.","school":"transmutation","castTime":"1 action or 8 hours","range":"150 feet","concentration":false,"duration":"Instantaneous","components":["V","S"],"material":"","minimumLevel":"3","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Speak With Plants","description":"You imbue plants within 30 feet of you with limited sentience and animation, giving them the ability to communicate with you and follow your simple commands. You can question plants about events in the spell's area within the past day, gaining information about creatures that have passed, weather, and other circumstances. You can also turn difficult terrain caused by plant growth (such as thickets and undergrowth) into ordinary terrain that lasts for the duration. Or you can turn ordinary terrain where plants are present into difficult terrain that lasts for the duration, causing vines and branches to hinder pursuers, for example. Plants might be able to perform other tasks on your behalf, at the DM's discretion. The spell doesn't enable piants to uproot themselves and move about, but they can freely move branches, tendrils, and stalks. If a plant creature is in the area, you can communicate with it as if you shared a common language, but you gain no magical ability to influence it. This spell can cause the plants created by the entangle spell to release a restrained creature.","school":"transmutation","castTime":"1 action","range":"Self (30-foot radius)","concentration":false,"duration":"10 minutes","components":["V","S"],"material":"","minimumLevel":"3","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Call Lightning","description":"A storm cloud appears in the shape of a cylinder that is 10 feet tall with a 60-foot radius, centered on a point you can see 100 feet directly above you. The spell fails if you can't see a point in the air where the storm cloud could appear (for example, if you are in a room that can't accommodate the cloud). When you cast the spell, choose a point you can see within range. A bolt of lightning flashes down from the cloud to that point. Each creature within 5 feet of that point must make a Dexterity saving throw. A creature takes 3d10 lightning damage on a failed save, or half as much damage on a successful one. On each of your turns until the spell ends, you can use your action to call down lightning in this way again, targeting the same point or a different one. If you are outdoors in stormy conditions when you cast this spell, the spell gives you control over the existing storm instead of creating a new one. Under such conditions, the spell's damage increases by 1410. At Higher Levels. When you cast this spell using a spell slot of 4th or higher level, the damage increases by 1d10 for each slot level above 3rd.","school":"conjuration","castTime":"1 action","range":"120 feet Componenis: V,S ","concentration":false,"duration":"Concentration. up to 10 minutes","components":["V","S"],"material":"","minimumLevel":"3","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Conjure Animals","description":"You summon fey spirits that take the form of beasts and appear in unoccupied spaces that you can see within range. Choose one of the following options for what appears: + One beast of challenge rating 2 or lower - Two beasts of challenge rating 1 or lower + Four beasts of challenge rating 1/2 or lower + Eight beasts of challenge rating 1/4 or lower Each beast is also considered fey, and it disappears when it drops to 0 hit points or when the spell ends. The summoned creatures are friendly to you and your companions. Roll initiative for the summoned creatures as a group, which has its own turns. They obey any verbal commands that you issue to them (no action required by you). If you don't issue any commands to them, they defend themselves from hostile creatures, but otherwise take no actions. The DM has the creatures' statistics. At Higher Levels. When you cast this spell using certain higher level spell slots, you choose one of the summoning options above, and more creatures appear: twice as many with a 5th level slot, three times as many with a 7th level slot, and four times as many with a 9th level slot.","school":"conjuration","castTime":"1 action","range":"60 feet","concentration":true,"duration":"up to 1 hour","components":["V"],"material":"","minimumLevel":"3","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Daylight","description":"A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet. If you chose a point on an object you are holding or one that isn't being worn or carried, the light shines from the object and moves with it. Completely covering the affected object with an opaque object, such as a bowl or a helm, blocks the light. If any of this spell's area overlaps with an area of darkness created by a spell of 3rd level or lower, the spell that created the darkness is dispelled.","school":"evocation","castTime":"1 action","range":"60 feet","concentration":false,"duration":"1 hour","components":["V","S"],"material":"","minimumLevel":"3","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Meld Into Stone","description":"You step into a stone object or surface large enough to fully contain your body, melding yourself and all the equipment you carry with the stone for the duration. Using your movement, you step into the stone at a point you can touch. Nothing of your presence remains visible or otherwise detectable by nonmagical senses. While merged with the stone, you can't see what occurs outside it, and any Wisdom (Perception) checks you make to hear sounds outside it are made with disadvantage. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use your movement to leave the stone where you entered it, which ends the spell. You otherwise can't move. Minor physical damage to the stone doesn't harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals 6d6 bludgeoning damage to you. The stone's complete destruction (or transmutation into a different substance) expels you and deals 50 bludgeoning damage to you. If expelled, you fall prone in an unoccupied space closest to where you first entered.","school":"transmutation","castTime":"1 action","range":"Touch","concentration":false,"duration":"8 hours","components":["V","S"],"material":"","minimumLevel":"3","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Protection From Energy","description":"For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder.","school":"abjuration","castTime":"1 action Range; Touch ","range":"500 miles","concentration":true,"duration":"up to | hour","components":["V","S"],"material":"","minimumLevel":"3","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Sleet Storm","description":"Until the spell ends, freezing rain and sleet fall ina 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused. The ground in the area is covered with slick ice, making it difficult terrain. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Dexterity saving throw, On a failed save, it falls prone. Ifa creature is concentrating in the spell's area, the creature must make a successful Constitution saving throw against your spell save DC or lose concentration.","school":"conjuration","castTime":"1 action","range":"150 feet","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"a pinch of dust and a few drops of water","minimumLevel":"3","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Water Breathing","description":"This spell grants up to ten willing creatures you can see within range the ability to breathe underwater until the spell ends. Affected creatures also retain their normal mode of respiration.","school":"transmutation","castTime":"1 action","range":"30 feet","concentration":false,"duration":"24 hours","components":["V","S","M"],"material":"a short reed or piece of straw","minimumLevel":"3","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Water Walk","description":"This spell grants the ability to move across any liquid surface—such as water, acid, mud, snow, quicksand, or lava—as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures you can see within range gain this ability for the duration. If you target a creature submerged in a liquid, the spell carries the target to the surface of the liquid at a rate of 60 feet per round.","school":"transmutation","castTime":"1 action","range":"30 feet","concentration":false,"duration":"| hour","components":["V","S","M"],"material":"a piece of cork","minimumLevel":"3","ritual":true,"spellAttack":false,"spellcastingAbility":"wisdom"},{"name":"Wind Wall","description":"A wall of strong wind rises from the ground at a point you choose within range. You can make the wall up to 50 feet long, 15 feet high, and 1 foot thick. You can shape the wall in any way you choose so long as it makes one continuous path along the ground. The wall lasts for the duration. When the wall appears, each creature within its area must make a Strength saving throw. A creature takes 3d8 bludgeoning damage on a failed save, or half as much damage on a successful one. The strong wind keeps fog, smoke, and other gases at bay. Small or smaller flying creatures or objects can't pass through the wall. Loose, lightweight materials brought into the wall fly upward. Arrows, bolts, and other ordinary projectiles launched at targets behind the wall are deflected upward and automatically miss. (Boulders hurled by giants or siege engines, and similar projectiles, are unaffected.) Creatures in gaseous form can't pass through it.","school":"evocation","castTime":"1 action","range":"120 feet","concentration":true,"duration":"up to 1 minute","components":["V","S","M"],"material":"a tiny fan and a feather of exotic origin","minimumLevel":"3","ritual":false,"spellAttack":false,"spellcastingAbility":"wisdom"}],"4":[],"5":[],"6":[],"7":[],"8":[],"9":[]},"abilityScores":{"strength":{"savingThrowProficiency":false,"name":"Str","score":8,"scoreMax":20,"modifier":{"value":-1}},"dexterity":{"savingThrowProficiency":false,"name":"Dex","score":14,"scoreMax":20,"modifier":{"value":2}},"constitution":{"savingThrowProficiency":false,"name":"Con","score":12,"scoreMax":20,"modifier":{"value":1}},"intelligence":{"savingThrowProficiency":true,"name":"Int","score":10,"scoreMax":20,"modifier":{"value":0}},"wisdom":{"savingThrowProficiency":true,"name":"Wis","score":18,"scoreMax":20,"modifier":{"value":4}},"charisma":{"savingThrowProficiency":false,"name":"Cha","score":16,"scoreMax":20,"modifier":{"value":3}}},"proficiency":{"baseBonus":{"value":3},"halfBonus":{"value":1}},"baseStats":{"initiativeBonus":{"base":0,"modifier":{"value":2},"bonus":{"value":0}},"baseArmorClass":{"base":10,"modifier":{"value":2},"bonus":{"value":0}},"hpMax":{"base":8,"modifier":{"value":1},"bonus":{"value":0}},"passivePerception":{"base":10,"modifier":{"value":4},"bonus":{"value":0}},"passiveInvestigation":{"base":10,"modifier":{"value":0},"bonus":{"value":0}},"passiveInsight":{"base":10,"modifier":{"value":4},"bonus":{"value":0}}},"skills":{"acrobatics":{"ability":"dexterity","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":0}},"animal handling":{"ability":"wisdom","modifier":{"value":4},"proficient":false,"expertise":false,"bonus":{"value":0}},"arcana":{"ability":"intelligence","modifier":{"value":0},"proficient":false,"expertise":false,"bonus":{"value":0}},"athletics":{"ability":"strength","modifier":{"value":-1},"proficient":false,"expertise":false,"bonus":{"value":0}},"deception":{"ability":"charisma","modifier":{"value":3},"proficient":true,"expertise":false,"bonus":{"value":0}},"history":{"ability":"intelligence","modifier":{"value":0},"proficient":false,"expertise":false,"bonus":{"value":0}},"insight":{"ability":"wisdom","modifier":{"value":4},"proficient":true,"expertise":false,"bonus":{"value":0}},"intimidation":{"ability":"charisma","modifier":{"value":3},"proficient":false,"expertise":false,"bonus":{"value":0}},"investigation":{"ability":"intelligence","modifier":{"value":0},"proficient":true,"expertise":false,"bonus":{"value":0}},"medicine":{"ability":"wisdom","modifier":{"value":4},"proficient":false,"expertise":false,"bonus":{"value":0}},"nature":{"ability":"intelligence","modifier":{"value":0},"proficient":false,"expertise":false,"bonus":{"value":0}},"perception":{"ability":"wisdom","modifier":{"value":4},"proficient":true,"expertise":false,"bonus":{"value":0}},"performance":{"ability":"charisma","modifier":{"value":3},"proficient":false,"expertise":false,"bonus":{"value":0}},"persuasion":{"ability":"charisma","modifier":{"value":3},"proficient":true,"expertise":false,"bonus":{"value":0}},"religion":{"ability":"intelligence","modifier":{"value":0},"proficient":false,"expertise":false,"bonus":{"value":0}},"sleight of hand":{"ability":"dexterity","modifier":{"value":2},"proficient":false,"expertise":false,"bonus":{"value":0}},"stealth":{"ability":"dexterity","modifier":{"value":2},"proficient":true,"expertise":false,"bonus":{"value":0}},"survival":{"ability":"wisdom","modifier":{"value":4},"proficient":false,"expertise":false,"bonus":{"value":0}}},"attacks":[{"name":"Scimitar","attackBonus":{"ability":{"value":2},"proficient":true,"itemBonus":{"value":0}},"dice":"1d6","damageType":"Slashing","damageBonus":{"value":2}}],"armorClasses":[{"name":"Base","base":10,"modifier":[{"value":2}],"bonus":{"value":0}},{"name":"Shield","base":10,"modifier":[{"value":2}],"bonus":{"value":0}},{"name":"Leather","base":11,"modifier":[{"value":2}],"bonus":{"value":0}}],"speeds":[{"name":"Base Speed","base":{"value":30},"bonus":{"value":0}}],"size":"Medium","spellcasting":[{"title":"DRUID","preparedSpells":{"level":{"value":5},"modifier":{"value":4}},"spellSave":{"base":8,"proficiency":{"value":3},"modifier":{"value":4}},"spellAttack":{"proficiency":{"value":3},"modifier":{"value":4}}}],"hitDie":"d8"}