{
  "title": "War Domain", 
  "description": "War has many manifestations. It can make heroes of ordinary people. It can be desperate and horrific, with acts of crulety and cowardice eclipsing isntances of excellence and courage. In either case, the gods of war watch over warriors and reward them for their great deeds. The clerics of such gods excel in battle, inspiring others to fight the good fight or offering acts of violence as prayers. Gods of war include champions of honor and chivalry (such as Torm, Heironeous, and Kiri-Jolith) as well as gods of destruction and pillage (such as Erythnul, the Fury, Gruumash, and Ares) and gods of conquest and domnation (such as Bane, Hextor, and Maglubiyet). Other war gods (such as Tempus, Nike, and Nuada) take  amore netural stance, promoting war in all its manifestations and supporting warriors in any circumstance.", 
  "features": {
    "1": {
      "BONUS PROFICIENCIES": {
        "title": "Bonus Proficiencies", 
        "description": "At 1st level, you gain proficiency with martial weapons and heavy armor."
      }, 
      "WAR PRIEST": {
        "title": "War Priest", 
        "description": "Your god delivers bolts of inspiration to you while you are engaged in battle. hen you use the Attack action, you can make one weapon attack as a bonus action. You can use this feature a number of times qual to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest."
      }
    }, 
    "2": {
      "GUIDED STRIKE": {
        "title": "Channel Divinity: Guided Strike", 
        "description": "You can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You can make this choice after you see the roll, but before the DM says whether the attack hits or misses."
      }
    }, 
    "6": {
      "WAR GOD'S BLESSING": {
        "title": "Channel Divinity: War God's Blessing", 
        "description": "When a creature within 30 feet of you makes an attack roll, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the attack hits or misses."
      }
    }, 
    "8": {
      "DIVINE STRIKE": {
        "title": "Divine Strike", 
        "description": "You gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the sametype dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8."
      }
    }, 
    "17": {
      "AVATAR OF BATTLE": {
        "title": "Avatar of Battle", 
        "description": "You gain resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons."
      }
    }
  }
}