{
  "title": "School of Transmutation", 
  "description": "You are a student of spells that modify energy and matter. To you, the world is not a fixed thing, but eminently mutable, and you delight in being an agent of change. You wield the raw stuff of creation and learn to alter both physical forms and mental qualities. Your magic gives you the tools to become a smith on reality’s forge.\nSome transmuters are tinkerers and pranksters, turning people into toads and transforming copper into silver for fun and occasional profit. Others pursue their magical studies with deadly seriousness, seeking the power of the gods to make and destroy worlds.", 
  "features": {
    "2": {
      "TRANSMUTATION SAVANT": {
        "title": "Transmutation Savant", 
        "description": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy a transmutation spell into your spellbook is halved."
      }, 
      "MINOR ALCHEMY": {
        "title": "Minor Alchemy", 
        "description": "Starting at 2nd level when you select this school, you can temporarily alter the physical properties of one nonmagical object, changing it from one substance into another. You perform a special alchemical procedure on one object com posed entirely of wood, stone (but not a gemstone), iron, copper, or silver, transforming it into a different one of those materials. For each 10 minutes you spend performing the procedure, you can transform up to 1 cubic foot of material. After 1 hour, or until you lose your concentration (as if you were concentrating on a spell), the material reverts to its original substance."
      }
    }, 
    "6": {
      "TRANSMUTER'S STONE": {
        "title": "Transmuter's Stone", 
        "description": "Starting at 6th level, you can spend 8 hours creating a transmuter’s stone that stores transmutation magic. You can benefit from the stone yourself or give it to another creature. A creature gains a benefit of your choice as long as the stone is in the creature’s possession. When you create the stone, choose the benefit from the following options:\nDarkvision out to a range of 60 feet, as described in chapter 8\nAn increase to speed of 10 feet while the creature is unencumbered\nProficiency in Constitution saving throws\nResistance to acid, cold, fire, lightning, or thunder damage (your choice whenever you choose this benefit)\nEach time you cast a transmutation spell of 1st level or higher, you can change the effect of your stone if the stone is on your person.\nIf you create a new transmuter’s stone, the previous one ceases to function."
      }
    }, 
    "10": {
      "SHAPECHANGER": {
        "title": "Shapechanger", 
        "description": "At 10th level, you add the Polymorph spell to your spellbook, if it is not there already. You can cast Polymorph without expending a spell slot. When you do so, you can target only yourself and transform into a beast whose challenge rating is 1 or lower.\nOnce you cast Polymorph in this way, you can’t do so again until you finish a short or long rest, though you can still cast it normally using an available spell slot."
      }
    }, 
    "14": {
      "MASTER TRANSMUTER": {
        "title": "Master Transmuter", 
        "description": "Starting at 14th level, you can use your action to consume the reserve of transmutation magic stored within your transmuter’s stone in a single burst. When you do so, choose one of the following effects. Your transmuter’s stone is destroyed and can’t be remade until you finish a long rest.\nMajor Transformation: You can transmute one nonmagical object—no larger than a 5-foot cube—into another nonmagical object of similar size and m ass and of equal or lesser value. You must spend 10 minutes handling the object to transform it.\n Panacea: You remove all curses, diseases, and poisons affecting a creature that you touch with the transmuter’s stone. The creature also regains all its hit points.\n Restore Life: You cast the raise dead spell on a creature you touch with the transmuter’s stone, without expending a spell slot or needing to have the spell in your spellbook.\nRestore Youth: You touch the transmuter’s stone to a willing creature, and that creature’s apparent age is reduced by 3d10 years, to a minimum of 13 years. This effect doesn’t extend the creature’s lifespan."
      }
    }
  }
}