{
    "BARBARIAN": {
        "BERSERKER": {
            "title": "Beserker",
            "description": "For some barbarians, rage is a means to an end - that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the berkerser's rage, you thrill in the chaos of battle, heedless of your own health or well-being.",
            "features": {
                "3": {
                    "FRENZY": {
                        "title": "Frenzy",
                        "description": "Can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion (as described in appendix A)."
                    } 
                },
                "6": {
                    "MINDLESS RAGE": {
                        "title": "Mindless Rage",
                        "description": "Beginning at 6th level, you can't be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage."
                    }
                },
                "10": {
                    "INTIMIDATING PRESENCE": {
                        "title": "Intimidating Presence",
                        "description": "Beginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you. If the creature succeeds on its saving throw, you cant use this feature on that creature again for 24 hours."
                    }
                },
                "14": {
                    "RETALIATION": {
                        "title": "Retaliation",
                        "description": "Starting at 14th level. when you take damage from a creature that is within 5 feet of you. you can use your reaction to make a melee weapon attack against that creature."
                    }
                }
            }
        },
        "TOTEM WARRIOR": {
            "title": "Totem Warrior",
            "description": "The Path of the Totem Warrior is a spiritual journey, as the barbarian accepts a spirit animal as guide, protector, and inspiration. In battle, your totem spirit fills you with supernatural might, adding magical fuel to your barbarian rage. Most barbarian tribes consider a totem animal to be kin to a particular clan. {n such cases. it is unusual for an individual to have more than one totem animal spirit, though exceptions exist.",
            "features": {
                "3": {
                    "SPIRIT SEEKER" : {
<<<<<<< HEAD
                        "title": "Spirit Seeker",
                        "description": "Yours is a path that seeks attunement with the natural world. giving you a kinship with beasts. At 3rd level when you adopt this path, you gain the ability to cast the beast sense and speak with animals spells. but only as rituals, as described in chapter 10."
                    },
                    "BEAR": {
                        "title": "Bear",
                        "description": "While raging. you have resistance to all damage except psychic damage. The spirit of the bear makes you tough enough to stand up to any punishment."
                    },
                    "EAGLE": {
                        "title": "Eagle",
                        "description": "While you're raging and aren't wearing heavy armor, other creatures have disadvantage on Opportunity attack rolls against you, and you can use the Dash action as a bonus action on your turn. The spirit of the eagle makes you into a predator who can weave through the fray with ease."
                    },
                    "WOLF": {
                        "title": "Wolf",
=======
                        "title": "Sprit Seeker",
                        "description": "Yours is a path that seeks attunement with the natural world. giving you a kinship with beasts. At 3rd level when you adopt this path, you gain the ability to cast the beast sense and speak with animals spells. but only as rituals, as described in chapter 10."
                    },
                    "BEAR": {
                        "title": "Bear (Lvl 3)",
                        "description": "While raging. you have resistance to all damage except psychic damage. The spirit of the bear makes you tough enough to stand up to any punishment."
                    },
                    "EAGLE": {
                        "title": "Eagle (Lvl 3)",
                        "description": "While you're raging and aren't wearing heavy armor, other creatures have disadvantage on Opportunity attack rolls against you, and you can use the Dash action as a bonus action on your turn. The spirit of the eagle makes you into a predator who can weave through the fray with ease."
                    },
                    "WOLF": {
                        "title": "Wolf (Lvl 3)",
>>>>>>> d98201649b0f4b0662cc3ba4522d747de237068e
                        "description": " While you're raging, your friends have advantage on melee attack rolls against any creature within 5 feet of you that ts hostile to you. The spirit of the wolf makes you a leader of hunters."
                    }
                },
                "6": {
                    "BEAR": {
<<<<<<< HEAD
                        "title": "Bear",
                        "description": "You gain the might of a bear. Your carrying capacitv (including maximum load and maximum lift) is doubled, and you have advantage on Strength checks made to push, pull, lift. or break objects."
                    },
                    "EAGLE": {
                        "title": "Eagle",
                        "description": "You gain the eyesight of an eagle. You can see up to 1 mile away with no difficulty, able to discern even fine details as though looking at something no more than 100 feet away from you. Additionally, dim light doesn't impose disadvantage on your Wisdom (Perception) checks."
                    },
                    "WOLF": {
                        "title": "Wolf",
=======
                        "title": "Bear (Lvl 6)",
                        "description": "You gain the might of a bear. Your carrying capacity (including maximum load and maximum lift) is doubled, and you have advantage on Strength checks made to push, pull, lift. or break objects."
                    },
                    "EAGLE": {
                        "title": "Eagle (Lvl 6)",
                        "description": "You gain the eyesight of an eagle. You can see up to 1 mile away with no difficulty, able to discern even fine details as though looking at something no more than 100 feet away from you. Additionally, dim light doesn't impose disadvantage on your Wisdom (Perception) checks."
                    },
                    "WOLF": {
                        "title": "Wolf (Lvl 6)",
>>>>>>> d98201649b0f4b0662cc3ba4522d747de237068e
                        "description": "You gain the hunting sensibilities of a wolf. You can track other creatures while traveling at a fast pace, and you can move stealthily while traveling at a normal pace (see chapter & for rules on travel pace)."
                    }
                },
                "10": {
                    "SPIRIT WALKER": {
                        "title": "Spirit Walker", 
<<<<<<< HEAD
                        "description": "At 10th level. vou can cast the commune with nature spell, but onlv as a ritual. When you do so, a spiritual version of one of the animals you chose for Totem Spirit or Aspect of the Beast appears to you to convey the information you seek."
=======
                        "description": "At 10th level. vou can cast the commune with nature spell, but only as a ritual. When you do so, a spiritual version of one of the animals you chose for Totem Spirit or Aspect of the Beast appears to you to convey the information you seek."
>>>>>>> d98201649b0f4b0662cc3ba4522d747de237068e
                    }
                },
                "14": {
                    "BEAR": {
<<<<<<< HEAD
                        "title": "Bear",
                        "description": "While you're raging, any creature within 5 feet of you that's hostile to you has disadvantage on attack rolls against targets other than you or another character witb this feature. An enemy is immune to this effect if it cant see or hear you or if it can't be frightened."
                    },
                    "EAGLE": {
                        "title": "Eagle",
                        "description": "While raging, you have a flying speed equal to your current walking speed. This benefit works only in short bursts; you fall if you end your turn in the air and nothing else is holding you aloft."
                    },
                    "WOLF": {
                        "title": "Wolf",
=======
                        "title": "Bear (Lvl 14)",
                        "description": "While you're raging, any creature within 5 feet of you that's hostile to you has disadvantage on attack rolls against targets other than you or another character witb this feature. An enemy is immune to this effect if it cant see or hear you or if it can't be frightened."
                    },
                    "EAGLE": {
                        "title": "Eagle (Lvl 14)",
                        "description": "While raging, you have a flying speed equal to your current walking speed. This benefit works only in short bursts; you fall if you end your turn in the air and nothing else is holding you aloft."
                    },
                    "WOLF": {
                        "title": "Wolf (Lvl 14)",
>>>>>>> d98201649b0f4b0662cc3ba4522d747de237068e
                        "description": "While you're raging, you can use a bonus action on your turn to knock a large or smaller creature prone when you hit it with melee weapon attack."
                    }
                }
            }
        },
        "BARD": {

        },
        "CLERIC": {

        },
        "DRUID": {

        },
        "FIGHTER": {

        },
        "MONK": {

        },
        "PALADIN": {

        },
        "RANGER": {

        },
        "ROGUE": {

        },
        "SORCEROR": {

        },
        "WARLOCK": {

        },
        "WIZARD": {

        }
    }
}