{
    "BARBARIAN": {
        "1": {
            "RAGE": {
                "title": "Rage", 
                "description": "In battle, you fight with primal ferocity. On your turn you can enter a rage as a bonus action. While raging, you gain the following benefits if you aren't wearing any heavy armor:  - You have advantage on Strength checks and Strength saving throws.  - When you make a melee weapon attack using Strength, yuo gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.  - You have resistance to bludgeoning, piercing, and slashing damage.  If you are able to cast spells, you can't cast them or concentrate on them while raging.  Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on youor turn as a bonus action.  Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
            },
            "UNARMORED DEFENSE": {
                "title": "Unarmored Defense",
                "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
            }
        },
        "2": {
            "RECKLESS ATTACK": {
                "title": "Reckless Attack", 
                "description": "You can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so give you advantage on the melee weapon attack rolls using Strength during this turn, but attack rolls against your have advantage until your next turn."
            },
            "DANGER SENSE": {
                "title": "Danger Sense", 
                "description": "You gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger.   You have advantage on Dexterity saving throws againist effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated."
            }
        },
        "5": {
            "EXTRA ATTACK": {
                "title": "Extra Attack", 
                "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn."
            },
            "FAST MOVEMENT": {
                "title": "Fast Movement", 
                "description": "Your speed increases by 10 feet while you aren't wearing heavy armor."
            }
        },
        "7": {
            "FERAL INSTINCT": {
                "title": "Feral Instinct", 
                "description": "Your instincts are so honed that you have advantage on initiative rolls.  Additionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
            }
        },
        "9": {
            "BRUTAL CRITICAL": {
                "title": "Brutal Critical", 
                "description": "You can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack."
            }
        },
        "11": {
            "RELENTLESS RAGE": {
                "title": "Relentless Rage", 
                "description": "Your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, yuo can make a DC 10 Coonstitution saving throw. If you succeed, you can drop to 1 hit point instead.  Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
            }
        },
        "15": {
            "PERSISTENT RAGE": {
                "title": "Persistent Rage", 
                "description": "Your rage is so fierce that it ends early only if you fall unconscious or choose to end it."
            } 
        },
        "18": {
            "INDOMITABLE MIGHT": {
                "title": "Indomitable Might", 
                "description": "If your total for a strength check is less than your Strength score, you can use that score in place of the total."
            }
        },
        "20": {
            "PRIMAL CHAMPION": {
                "title": "Primal Champion", 
                "description": "You embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
            }
        }
    }, 
    "BARD": {
        "1": {
            "BARDIC INSPIRATION": {
                "title": "Bardic Inspiration",
                "description": "You can inspire others through stirring words or music. To do so, you use a bonus action your turn to choose one creature other than  yourself within 60 feat of you who can hear you. That creature gains one Bardic Inspiration die, a d6.  Once within the next ten minutes, the creature can roll the die and add the number rolled to one ability check, attack  roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.  You can use this feature a number of times equal to your Charisma modifier (minimum of once). You regain any expended uses when you finish a long rest."
            }
        },
        "2": {
            "JACK OF ALL TRADES": {
                "title": "Jack of All Trades",
                "description": "You can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus."
            },
            "SONG OF REST": {
                "title": "Song of Rest",
                "description": "You can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest, each of those creatures regains an extra 1d6 hit points."
            }
        },
        "3": {
            "EXPERTISE": {
                "title": "Expertise",
                "description": "Choose two of your skill proficiencies. Your proficiency bonus is doubled for any abiility check you make that uses either of the chosen proficiencies. At 10th level, you choose another two skill proficiencies to gain this benefit."
            }
        },
        "5": {
            "FONT OF INSPIRATION": {
                "title": "Font of Inspiration",
                "description": "You regain all your expended uses of Bardic Inspiration when you finish a short or long rest."
            }
        },
        "6": {
            "COUNTERCHARM": {
                "title": "Countercharm",
                "description": "You gain the ability to use musical notes or words of power to  disrupt mind-influencing effects. As an action,  you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit.  The performance ends early if you are incapacitated or silenced if you voluntarily end it (no action requred)."
            }
        },
        "10": {
            "MAGICAL SECRETS": {
                "title": "Magical Secrets",
                "description": "You have plundered magical knowledge from a wide spectrum of disciplines.  Choose two spells from any class, including this one. A spell you choose mustt be of a level you can cast, as shown on the Bard table, or a cantrip.  The chosen spells count as a bard spells for you and are included in the number in the Spells Known column of the Bard table.  You learn two additional spells from any class at 14th level and again at 18th level."
            }
        },
        "20": {
            "SUPERIOR INSPIRATION": {
                "title": "Superior Inspiration",
                "description": "When you roll initiative and have no uses of Bardic Inspiration left, you regain one use."
            }
        }
    },
    "CLERIC": {
        "1": {},
        "2": {
            "CHANNEL DIVINITY: TURN UNDEAD": {
                "title": "Channel Divinity: Turn Undead",
                "description": "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\nA turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also cant take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action."
            }
        },
        "5": {
            "DESTROY UNDEAD": {
                "title":  "Destroy Undead",
                "description": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table"
            }
        },
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {
            "DIVINE INTERVENTION": {
                "title": "",
                "description": ""
            }
        },
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {
            "DIVINE INTERVENTION IMPROVEMENT": {
                "title": "",
                "description": ""
            }
        }
    },
    "DRUID": {
        "1": {
            "DRUIDIC": {
                "title": "",
                "description": ""
            }
        },
        "2": {
            "WILDSHAPE": {
                "title": "",
                "description": ""
            }
        },
        "3": {},
        "4": {
            "WILDSHAPE IMPROVEMENT": {
                "title": "",
                "description": ""
            }
        },
        "5": {},
        "6": {},
        "7": {},
        "8": {
            "WILDSHAPE IMPROVEMENT": {
                "title": "",
                "description": ""
            }
        },
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {
            "TIMELESS BODY": {
                "title": "",
                "description": ""
            },
            "BEAST SPELLS": {
                "title": "",
                "description": ""
            }
        },
        "19": {},
        "20": {
            "ARCHDRUID": {
                "title": "",
                "description": ""
            }
        }
    },
    "FIGHTER": {
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {}
    },
    "MONK": {
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {}
    },
    "PALADIN": {
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {}
    },
    "RANGER": {
        "1": {
            "FAVORED ENEMY": {
                "title": "Favored Enemy", 
                "description": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. Choose a type of favored enemy. You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all."
            },
            "NATURAL EXPLORER": {
                "title": "Natural Explorer", 
                "description": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in. While traveling for an hour or more in your favored terrain, you gain the following benefits:  - Difficult terrain doesn’t slow your group’s travel.  - Your group can’t become lost except by magical means.  -  Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.  - If you are traveling alone, you can move stealthily at a normal pace.  -  When you forage, you find twice as much food as you normally would.  - While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area."
            }
        },
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {}
    },
    "ROGUE": {
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {}
    },
    "SORCEROR": {
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {}
    },
    "WARLOCK": {
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {}
    },
    "WIZARD": {
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {}
    }
}
