{
  "CAREFUL SPELL": {
    "title": "Careful Spell",
    "description": "When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell's full force. To do so, you spend 1 sorcery point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell."
  },
  "DISTANT SPELL": {
    "title": "Distant Spell",
    "description": "When you cast a spell that has a range of 5 feet or greater, you can spend 1 sorcery point to double the range of the spell. When you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the spell 30 feet."
  },
  "EMPOWERED SPELL": {
    "title": "Empowered Spell",
    "description": "When you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls.You can use Empowered Spell even if you have already used a different Metamagic option during the casting of the spell."
  },
  "EXTENDED SPELL": {
    "title": "Extended Spell",
    "description": "When you cast a spell that has a duration of 1 minute or longer, you can spend 1 sorcery point to double its duration, to a maximum duration of 24 hours."
  },
  "HEIGHTENED SPELL": {
    "title": "Heightened Spell",
    "description": "When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 sorcery points to give one target of the spell disadvantage on its first saving throw made against the spell"
  },
  "QUICKENED SPELL": {
    "title": "Quickened Spell",
    "description": "When you cast a spell! that has a casting time of 1 action. You can spend 2 sorcery points to change the casting time to 1 bonus action for this casting."
  },
  "SUBTLE SPELL": {
    "title": "Subtle Spell",
    "description": "When you cast a spell, you can spend 1 sorcery point to cast it without any somatic or verbal components."
  },
  "TWINNED SPELL": {
    "title": "Twinned Spell",
    "description": "When you cast a spell that targets only one creature and doesnt have a range of self, you can spend a number of sorcery points equal to the spell’s level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip)."
  }
}
