{
  "title": "Arcane Archer", 
  "description": "An Arcane Archer studies a unique elven method of archery that weaves magic into attacks to produce supernatural effects. Arcane Archers are some of the most elite warriors among the elves. They stand watch over the fringes of elven domains, keeping a keen eye out for trespassers and using magic-infused arrows to defeat monsters and invaders before they can reach elven settlements. Over the centuries, the methods of these elf archers have been learned by members of other races who can also balance arcane aptitude with archery.", 
  "features": {
    "3": {
      "ARCANE ARCHER LORE": {
        "title": "Arcane Archer Lore", 
        "description": "At 3rd level, you learn magical theory or some of the secrets of nature—typical for practitioners of this elven martial tradition. You choose to gain proficiency in either the Arcana or the Nature skill, and you choose to learn either the Prestidigitation or the Druidcraft cantrip."
      },
      "ARCANE SHOT": {
        "title": "Arcane Shot",
        "description": "At 3rd level, you learn to unleash special magical effects with some of your shots. When you gain this feature, you learn two Arcane Shot options of your choice. Once per turn when you fire an arrow from a shortbow or longbow as part of the Attack action, you can apply one of your Arcane Shot options to that arrow. You decide to use the option when the arrow hits a creature, unless the option doesn't involve an attack roll. You have two uses of this ability, and you regain all expended uses of it when you finish a short or long rest. You gain an additional Arcane Shot option of your choice when you reach certain levels in this class: 7th, 10th, 15th, and 18th level. Each option also improves when you become an 18th-level fighter."
      }
    }, 
    "7": {
      "MAGIC ARROW": {
        "title": "Magic Arrow", 
        "description": "At 7th level, you gain the ability to infuse arrows with magic. Whenever you fire a nonmagical arrow from a shortbow or longbow, you can make it magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage. The magic fades from the arrow immediately after it hits or misses its target."
      },
      "CURVING SHOT": {
        "title": "Curving Shot",
        "description": "At 7th level, you learn how to direct an errant arrow toward a new target. When you make an attack roll with a magic arrow and miss, you can use a bonus action to reroll the attack roll against a different target within 60 feet of the original target."
      },
      "ADDITIONAL ARCANE SHOT OPTION": {
        "title": "Additional Arcane Shot Option",
        "description": "You gain an additional Arcane Shot option of your choice when you reach 7th level."
      }
    }, 
    "10": {
      "ADDITIONAL ARCANE SHOT OPTION": {
        "title": "Additional Arcane Shot Option", 
        "description": "You gain an additional Arcane Shot option of your choice when you reach 10th level."
      }
    }, 
    "15": {
      "EVER-READY SHOT": {
        "title": "Superior Critical", 
        "description": "Your weapon attacks score a critical hit on a roll of 18-20."
      },
      "ADDITIONAL ARCANE SHOT OPTION": {
        "title": "Additional Arcane Shot Option",
        "description": "You gain an additional Arcane Shot option of your choice when you reach 15th level."
      }
    }, 
    "18": {
      "ADDITIONAL ARCANE SHOT OPTION": {
        "title": "Additional Arcane Shot Option", 
        "description": "You gain an additional Arcane Shot option of your choice when you reach 18th level. Each option also improves when you become an 18th-level fighter."
      }
    }
  }
}