{
  "title": "Twilight Domain", 
  "description": "The twilit transition from light into darkness often brings calm and even joy, as the day's labors end and the hours of rest begin. The darkness can also bring terrors, but the gods of twilight guard against the horrors of the night. Clerics who serve these deities-examples of which appear on the Twilight Deities table-bring comfort to those who seek rest and protect them by venturing into the encroaching darkness to ensure that the dark is a comfort, not a terror.", 
  "features": {
    "1": {
      "BONUS PROFICIENCIES": {
        "title": "Bonus Proficiencies", 
        "description": "You gain proficiency with martial weapons and heavy armor."
      }, 
      "EYES OF NIGHT": {
        "title": "Eyes of Night", 
        "description": "You can see through the deepest gloom. You have darkvision out to a range of 300 feet. In that radius, you can see in dim light as if it were bright light and in darkness as if it were dim light.\nAs an action, you can magically share the darkvision of this feature with willing creatures you can see within 10 feet of you, up to a number of creatures equal to your Wisdom modifier (minimum of one creature). The shared darkvision lasts for 1 hour. Once you share it, you can't do so again until you finish a long rest, unless you expend a spell slot of any level to share it again."
      },
      "VIGILANT BLESSING": {
        "title": "Vigilant Blessing", 
        "description": "The night has taught you to be vigilant. As an action, you give one creature you touch (including possibly yourself) advantage on the next initiative roll the creature makes. This benefit ends immediately after the roll or if you use this feature again."
      }
    }, 
    "2": {
      "TWILIGHT SANCTUARY": {
        "title": "Channel Divinity: Twilight Sanctuary", 
        "description": "You can use your Channel Divinity to refresh your allies with soothing twilight.\nAs an action, you present your holy symbol, and a sphere of twilight emanates from you. The sphere is centered on you, has a 30-foot radius, and is filled with dim light. The sphere moves with you, and it lasts for 1 minute or until you are incapacitated or die. Whenever a creature (including you) ends its turn in the sphere, you can grant that creature one of these benefits:\nYou grant it temporary hit points equal to 1d6 plus your cleric level.\nYou end one effect on it causing it to be charmed or frightened."
      }
    }, 
    "6": {
      "STEPS OF NIGHT": {
        "title": "Step of Night", 
        "description": "You can draw on the mystical power of night to rise into the air. As a bonus action when you are in dim light or darkness, you can magically give yourself a flying speed equal to your walking speed for 1 minute. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      }
    }, 
    "8": {
      "DIVINE STRIKE": {
        "title": "Divine Strike", 
        "description": "You gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage. When you reach 14th level, the extra damage increases to 2d8."
      }
    }, 
    "17": {
      "TWILIGHT SHROUD": {
        "title": "Twilight Shroud", 
        "description": "The twilight that you summon offers a protective embrace: you and your allies have half cover while in the sphere created by your Twilight Sanctuary."
      }
    }
  }
}