{
  "title": "Oath of Glory", 
  "description": "Paladins who take the Oath of Glory believe they and their companions are destined to achieve glory through deeds of heroism. They train diligently and encourage their companions so they're all ready when destiny calls.", 
  "features": {
    "3": {
      "PEERLESS ATHLETE": {
        "title": "Channel Divinity: Peerless Athlete", 
        "description": "As a bonus action, you can use your Channel Divinity to augment your athleticism. For the next 10 minutes, you have advantage on Strength (Athletics) and Dexterity (Acrobatics) checks; you can carry, push, drag, and lift twice as much weight as normal; and the distance of your long and high jumps increases by 10 feet (this extra distance costs movement as normal)."
      }, 
      "INSPIRING SMITE": {
        "title": "Channel Divinity: Inspiring Smite", 
        "description": "Immediately after you deal damage to a creature with your Divine Smite feature, you can use your Channel Divinity as a bonus action and distribute temporary hit points to creatures of your choice within 30 feet of you, which can include you. The total number of temporary hit points equals 2d8 + your level in this class, divided among the chosen creatures however you like."
      }
    }, 
    "7": {
      "AURA OF ALACRITY": {
        "title": "Aura of Alacrity", 
        "description": "You emanate an aura that fills you and your companions with supernatural speed, allowing you to race across a battlefield in formation. Your walking speed increases by 10 feet. In addition, if you aren't incapacitated, the walking speed of any ally who starts their turn within 5 feet of you increases by 10 feet until the end of that turn.\nWhen you reach 18th level in this class, the range of the aura increases to 10 feet."
      }
    }, 
    "15": {
      "GLORIOUS DEFENSE": {
        "title": "Glorious Defense", 
        "description": "You can turn defense into a sudden strike. When you or another creature you can see within 10 feet of you is hit by an attack roll, you can use your reaction to grant a bonus to the target's AC against that attack, potentially causing it to miss. The bonus equals your Charisma modifier (minimum of +1). If the attack misses, you can make one weapon attack against the attacker as part of this reaction, provided the attacker is within your weapon's range.\nYou can use this feature a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a long rest."
      }
    }, 
    "20": {
      "LIVING LEGEND": {
        "title": "Living Legend", 
        "description": "You can empower yourself with the legends—whether true or exaggerated—of your great deeds. As a bonus action, you gain the following benefits for 1 minute:\nYou are blessed with an otherworldly presence, gaining advantage on all Charisma checks.\nOnce on each of your turns when you make a weapon attack and miss, you can cause that attack to hit instead.\nIf you fail a saving throw, you can use your reaction to reroll it. You must use this new roll.\nOnce you use this feature, you can't use it again until you finish a long rest, unless you expend a 5th-level spell slot to use it again."
      }
    }
  }
}