{
  "title": "Fey Wanderer", 
  "description": "A fey mystique surrounds you, thanks to the boon of an archfey, the shining fruit you ate from a talking tree, the magic spring you swam in, or some other auspicious event. However you acquired your fey magic, you are now a Fey Wanderer, a ranger who represents both the mortal and the fey realms. As you wander the multiverse, your joyful laughter brightens the hearts of the downtrodden, and your martial prowess strikes terror in your foes, for great is the mirth of the fey and dreadful is their fury.", 
  "features": {
    "3": {
      "DREADFUL STRIKES": {
        "title": "Dreadful Strikes", 
        "description": "You can augment your weapon strikes with mind-scarring magic, drawn from the gloomy hollows of the Feywild. When you hit a creature with a weapon, you can deal an extra 1d4 psychic damage to the target, which can take this extra damage only once per turn.\nThe extra damage increases to 1d6 when you reach 11th level in this class."
      },
      "FEY WANDERER MAGIC": {
        "title": "Fey Wanderer Magic",
        "description": "You learn an additional spell when you reach certain levels in this class, as shown in the Fey Wanderer Spells table. Each spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know."
      },
      "OTHERWORLDLY GLAMOUR": {
        "title": "Otherworldly Glamour",
        "description": "Your fey qualities give you a supernatural charm. As a result, whenever you make a Charisma check, you gain a bonus to the check equal to your Wisdom modifier (minimum of +1).\nIn addition, you gain proficiency in one of the following skills of your choice: Deception, Performance, or Persuasion."
      }
    }, 
    "7": {
      "BEGUILING TWIST": {
        "title": "Beguiling Twist", 
        "description": "The magic of the Feywild guards your mind. You have advantage on saving throws against being charmed or frightened.\nIn addition, whenever you or a creature you can see within 120 feet of you succeeds on a saving throw against being charmed or frightened, you can use your reaction to force a different creature you can see within 120 feet of you to make a Wisdom saving throw against your spell save DC. If the save fails, the target is charmed or frightened by you (your choice) for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a successful save."
      }
    }, 
    "11": {
      "FEY REINFORCEMENTS": {
        "title": "FEY REINFORCEMENTS", 
        "description": "The royal courts of the Feywild have blessed you with the assistance of fey beings: you know summon fey. It doesn't count against the number of ranger spells you know, and you can cast it without a material component. You can also cast it once without a spell slot, and you regain the ability to do so when you finish a long rest.\nWhenever you start casting the spell, you can modify it so that it doesn't require concentration. If you do so, the spell's duration becomes 1 minute for that casting."
      }
    }, 
    "15": {
      "MISTY WANDERER": {
        "title": "Misty Wanderer", 
        "description": "You can slip in and out of the Feywild to move in a blink of an eye: you can cast misty step without expending a spell slot. You can do so a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a long rest.\nIn addition, whenever you cast misty step, you can bring along one willing creature you can see within 5 feet of you. That creature teleports to an unoccupied space of your choice within 5 feet of your destination space."
      }
    }
  }
}